<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8"/>
  <style>
    table.head, table.foot { width: 100%; }
    td.head-rtitle, td.foot-os { text-align: right; }
    td.head-vol { text-align: center; }
    div.Pp { margin: 1ex 0ex; }
  </style>
  <title>CONJUGUE(1)</title>
</head>
<body>
<table class="head">
  <tr>
    <td class="head-ltitle">CONJUGUE(1)</td>
    <td class="head-vol">br.ispell</td>
    <td class="head-rtitle">CONJUGUE(1)</td>
  </tr>
</table>
<div class="manual-text">
<h1 class="Sh" title="Sh" id="NOME"><a class="selflink" href="#NOME">NOME</a></h1>
conjugue - conjugador de verbos da l&#x00ED;ngua portuguesa
<h1 class="Sh" title="Sh" id="SINOPSE"><a class="selflink" href="#SINOPSE">SINOPSE</a></h1>
<b>conjugue [-v VARI&#x00C1;VEL=valor] ...</b>
<div>&#x00A0;</div>
<h1 class="Sh" title="Sh" id="DESCRI&#x00C7;&#x00C3;O"><a class="selflink" href="#DESCRI&#x00C7;&#x00C3;O">DESCRI&#x00C7;&#x00C3;O</a></h1>
<b>conjugue</b> l&#x00EA; um banco de verbos contendo paradigmas e listas de
  verbos que se conjugam segundo cada paradigma, e permite conjugar verbos
  atrav&#x00E9;s de um interface iterativa ou na forma de um comando simples
  dado no prompt do shell.
<div style="height: 1.00em;">&#x00A0;</div>
Pode&#x2010;se passar par&#x00E2;metros para o <b>conjugue</b> atrav&#x00E9;s da
  op&#x00E7;&#x00E3;o <b>-v</b> do <b>awk,</b> que permite predefinir o valor de
  uma vari&#x00E1;vel. As vari&#x00E1;veis no caso s&#x00E3;o:
<div style="height: 1.00em;">&#x00A0;</div>
<dl class="Bl-tag">
  <dt class="It-tag"><b>BANCO</b></dt>
  <dd class="It-tag">Path completo do banco de verbos (default
      /usr/lib/brazilian-conjugate/verbos).
    <div style="height: 1.00em;">&#x00A0;</div>
  </dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>NOVOS</b></dt>
  <dd class="It-tag">Path completo do arquivo onde o <b>conjugue</b> apenda
      verbos novos, que n&#x00E3;o constam ainda do banco (default
      $HOME/.conjugue-novos).
    <div style="height: 1.00em;">&#x00A0;</div>
  </dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>FORMATO</b></dt>
  <dd class="It-tag">Formato da sa&#x00ED;da. A sa&#x00ED;da &#x00E9; a
      conjuga&#x00E7;&#x00E3;o (as formas) do(s) verbos que se deseja conjugar.
      As possibilidades para a sa&#x00ED;da s&#x00E3;o: <b>c</b> (curto, usado
      para gerar listas de palavras), <b>n</b> (normal, o formato original, um
      pouco cr&#x00ED;ptico), <b>ci</b> (usado para listar os verbos para o
      br.ispell), <b>aa</b> (usado para gerar as regras de afixos verbais do
      br.ispell), <b>l</b> (longo, um pouco menos cr&#x00ED;ptico do que o
      &quot;n&quot;) e <b>ll</b> (muito longo, semelhante ao que as
      gram&#x00E1;ticas costumam usar). <b>b</b> (usado para gerar a lista dos
      paradigmas ou dos verbos nos formatos do dicion&#x00E1;rio base). O
      formato default &#x00E9; <b>l.</b>
    <div style="height: 1.00em;">&#x00A0;</div>
  </dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>CMD</b></dt>
  <dd class="It-tag">Execute esse comando. Nesse caso, o <b>conjugue</b> executa
      o comando dado e abandona. De outra forma, o <b>conjugue</b>
      apresentar&#x00E1; um prompt para a entrada de comandos iterativos. Os
      comandos dispon&#x00ED;veis s&#x00E3;o <b>?</b> para mostrar um
      sum&#x00E1;rio dos comandos, <b>a</b> para listar as
      abrevia&#x00E7;&#x00F5;es, <b>n</b> para exibir algumas notas, <b>f</b>
      para abandonar, e <b>T</b> para conjugar todos os verbos do banco. Para
      conjugar um verbo determinado, basta entrar com esse verbo no prompt de
      comandos (ou indic&#x00E1;&#x2010;lo na linha de comandos como valor
      inicial de <b>CMD</b> ).
    <div style="height: 1.00em;">&#x00A0;</div>
  </dd>
</dl>
<h1 class="Sh" title="Sh" id="EXEMPLOS"><a class="selflink" href="#EXEMPLOS">EXEMPLOS</a></h1>
1. Conjugar o verbo &quot;amar&quot; com a sa&#x00ED;da no formato muito longo:
<div style="height: 1.00em;">&#x00A0;</div>
$ conjugue -v FORMATO=ll -v CMD=amar
<div style="height: 1.00em;">&#x00A0;</div>
2. Entrar no modo iterativo e exibe as conjuga&#x00E7;&#x00F5;es no formato
  muito longo:
<div style="height: 1.00em;">&#x00A0;</div>
$ conjugue -v FORMATO=ll
<div style="height: 1.00em;">&#x00A0;</div>
3. Conjugar todos os verbos do banco explicitado, gerando uma lista de radicais
  para o br.ispell:
<div style="height: 1.00em;">&#x00A0;</div>
$ conjugue -v BANCO=verbos -v FORMATO=ci -v CMD=T
<div style="height: 1.00em;">&#x00A0;</div>
<h1 class="Sh" title="Sh" id="BANCO_DE_VERBOS"><a class="selflink" href="#BANCO_DE_VERBOS">BANCO
  DE VERBOS</a></h1>
O Banco de verbos cont&#x00E9;m a conjuga&#x00E7;&#x00E3;o dos paradigmas e,
  para cada um deles, uma lista de verbos que se conjugam segundo aquele
  paradigma. Cada paradigma pode conter tamb&#x00E9;m informa&#x00E7;&#x00F5;es
  para a heur&#x00ED;stica que deduz o paradigma a ser utilizado nos casos em
  que o banco n&#x00E3;o cont&#x00E9;m essa informa&#x00E7;&#x00E3;o. Segue uma
  descri&#x00E7;&#x00E3;o do formato do banco de verbos:
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
S ==
  [a-z&#x00E1;&#x00E9;&#x00ED;&#x00F3;&#x00FA;&#x00E0;&#x00E8;&#x00EC;&#x00F2;&#x00F9;&#x00E7;&#x00E3;&#x00F5;&#x00FC;]+
<div>&#x00A0;</div>
V == Sr
<div>&#x00A0;</div>
L == [S(,S)*]
<div>&#x00A0;</div>
F == L(:L)*
<div>&#x00A0;</div>
T == FN|IP|PI|II|EI|MI|TI|FI|PS|IS|FS|IA|IN
<div>&#x00A0;</div>
P == paradigma:V[:S]&lt;lf&gt;(T:F&lt;lf&gt;)*&lt;lf&gt;
<div>&#x00A0;</div>
A == abundante:V:L&lt;lf&gt;
<div>&#x00A0;</div>
B == [[P(V0*]|[A]]*
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
O banco pode conter, em qualquer posi&#x00E7;&#x00E3;o, linhas come&#x00E7;adas
  com o caracter &quot;#&quot; ou linhas em branco, que s&#x00E3;o desprezadas.
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
Em termos sem&#x00E2;nticos, os s&#x00ED;mbolos da gram&#x00E1;tica representam:
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
S String n&#x00E3;o nula
<div>&#x00A0;</div>
V Verbo
<div>&#x00A0;</div>
L Lista de strings
<div>&#x00A0;</div>
F Flex&#x00E3;o num tempo ou modo
<div>&#x00A0;</div>
T Nome de tempo ou modo
<div>&#x00A0;</div>
P Paradigma
<div>&#x00A0;</div>
A Partic&#x00ED;pio abundante
<div>&#x00A0;</div>
B Banco
<div style="height: 1.00em;">&#x00A0;</div>
O termo &lt;lf&gt; &#x00E9; uma quebra de linha. A lista de verbos que segue um
  dado paradigma s&#x00E3;o os verbos que se conjugam conforme aquele paradigma.
  A string eventualmente dada como &#x00FA;ltimo componente na linha P &#x00E9;
  a termina&#x00E7;&#x00E3;o que heuristicamente ser&#x00E1; utilizada para
  decidir quando usar aquele paradigma (no caso de verbos que n&#x00E3;o
  especificam um paradigma).
<div style="height: 1.00em;">&#x00A0;</div>
<h1 class="Sh" title="Sh" id="REGRAS_DE_TRANSFORMA&#x00C7;&#x00C3;O_DE_RADICAIS"><a class="selflink" href="#REGRAS_DE_TRANSFORMA&#x00C7;&#x00C3;O_DE_RADICAIS">REGRAS
  DE TRANSFORMA&#x00C7;&#x00C3;O DE RADICAIS</a></h1>
Alguns verbos irregulares t&#x00EA;m o radical alterado ao longo da
  conjuga&#x00E7;&#x00E3;o. Por esse motivo, &#x00E9; necess&#x00E1;rio que o
  programa deduza a partir do paradigma uma regra de altera&#x00E7;&#x00E3;o do
  radical, que ser&#x00E1; aplicada em todos os verbos que seguem aquele
  paradigma. Por exemplo, no verbo &quot;seguir&quot; a vogal &quot;e&quot; do
  radical &#x00E9; trocada por &quot;i&quot; em alguns casos (&quot;eu
  sigo&quot;).
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
O modo com que isso vem sendo tratado &#x00E9; meramente conhecer de
  antem&#x00E3;o os tipos de altera&#x00E7;&#x00F5;es de radicais, e
  codific&#x00E1;&#x2010;las. At&#x00E9; o momento foi poss&#x00ED;vel codificar
  todas as regras de modifica&#x00E7;&#x00E3;o de radicais atrav&#x00E9;s de
  varia&#x00E7;&#x00F5;es de uma &#x00FA;nica regra, a saber, a
  substitui&#x00E7;&#x00E3;o da &#x00FA;ltima vogal do radical ou da
  &#x00FA;ltima vogal do radical ap&#x00F3;s o descarte da sua &#x00FA;ltima
  letra.
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
O fun&#x00E7;&#x00E3;o <b>normaliza</b> do script cont&#x00E9;m uma tabela de
  transforma&#x00E7;&#x00E3;o de vogais que cobre todas as
  transforma&#x00E7;&#x00F5;es conhecidas at&#x00E9; o momento. Na eventualidade
  do conjugue exibir a mensagem &quot;vogal n&#x00E3;o normalizada&quot; ao ser
  iniciado, ser&#x00E1; necess&#x00E1;rio incluir uma nova regra de
  substitui&#x00E7;&#x00E3;o de vogais na fun&#x00E7;&#x00E3;o <b>normaliza,</b>
  e a sua inversa na fun&#x00E7;&#x00E3;o <b>desnormaliza.</b> O script
  documenta como adicionar novas regras.
<div style="height: 1.00em;">&#x00A0;</div>
<h1 class="Sh" title="Sh" id="FORMAS_ENCL&#x00CD;TICAS"><a class="selflink" href="#FORMAS_ENCL&#x00CD;TICAS">FORMAS
  ENCL&#x00CD;TICAS</a></h1>
A &#x00EA;nclise em alguns casos provoca altera&#x00E7;&#x00E3;o
  ortogr&#x00E1;fica do verbo, como por exemplo &quot;am&#x00E1;&#x2010;la&quot;
  (amar+ela). A partir da vers&#x00E3;o 1.1 o conjugue possui suporte
  espec&#x00ED;fico para gerar algumas dessas formas, mas isso s&#x00F3;
  est&#x00E1; ativo quando o formato de sa&#x00ED;da &#x00E9; &quot;ci&quot;.
  Para maiores detalhes, cheque por favor o fonte do conjugue.
<div style="height: 1.00em;">&#x00A0;</div>
<h1 class="Sh" title="Sh" id="ARQUIVOS"><a class="selflink" href="#ARQUIVOS">ARQUIVOS</a></h1>
/usr/lib/brazilian-conjugate/verbos - banco de verbos.
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
$HOME/.conjugue-novos - arquivo para apendar verbos que n&#x00E3;o constam do
  banco.
<div style="height: 1.00em;">&#x00A0;</div>
<h1 class="Sh" title="Sh" id="BUGS"><a class="selflink" href="#BUGS">BUGS</a></h1>
O arquivo no qual v&#x00E3;o sendo apendados verbos novos n&#x00E3;o &#x00E9;
  lido pelo conjugue na inicializa&#x00E7;&#x00E3;o.
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
A ocorr&#x00EA;ncia de um mesmo verbo mais de uma vez no banco provoca
  malfuncionamento do programa.
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
Essa man page cont&#x00E9;m caracteres acentuados, que em alguns sistemas talvez
  n&#x00E3;o sejam exibidos. Para visualiz&#x00E1;&#x2010;la corretamente,
  utilize um fonte ISO e, se o <b>groff</b> estiver dispon&#x00ED;vel, tente o
  comando
<div style="height: 1.00em;">&#x00A0;</div>
<div>&#x00A0;</div>
$ groff -Tlatin1 -man conjugue.1|more
<div style="height: 1.00em;">&#x00A0;</div>
<h1 class="Sh" title="Sh" id="VER_TAMB&#x00C9;M"><a class="selflink" href="#VER_TAMB&#x00C9;M">VER
  TAMB&#x00C9;M</a></h1>
<b>ispell</b>(1),
<h1 class="Sh" title="Sh" id="AUTOR"><a class="selflink" href="#AUTOR">AUTOR</a></h1>
Ricardo Ueda Karpischek &lt;ueda@ime.usp.br&gt;</div>
<table class="foot">
  <tr>
    <td class="foot-date">18 de outubro de 1999</td>
    <td class="foot-os">br.ispell</td>
  </tr>
</table>
</body>
</html>
