<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8"/>
  <style>
    table.head, table.foot { width: 100%; }
    td.head-rtitle, td.foot-os { text-align: right; }
    td.head-vol { text-align: center; }
    div.Pp { margin: 1ex 0ex; }
  </style>
  <title>DTAUS(1)</title>
</head>
<body>
<table class="head">
  <tr>
    <td class="head-ltitle">DTAUS(1)</td>
    <td class="head-vol"></td>
    <td class="head-rtitle">DTAUS(1)</td>
  </tr>
</table>
<div class="manual-text">
<h1 class="Sh" title="Sh" id="NAME"><a class="selflink" href="#NAME">NAME</a></h1>
dtaus - Converter for DTAUS files
<h1 class="Sh" title="Sh" id="SYNOPSIS"><a class="selflink" href="#SYNOPSIS">SYNOPSIS</a></h1>
<b>dtaus</b> [<b> -d </b> <i>dtaus</i> ] [<b> -c </b> <i>control</i> ] [<b> -b
  </b> <i>begleit</i> ] [<b> -l </b> [<i>begleit</i>] ] [<b> -o </b>
  <i>kontroll</i> ] <b>-dtaus</b> | <b>-control</b>
<h1 class="Sh" title="Sh" id="DESCRIPTION"><a class="selflink" href="#DESCRIPTION">DESCRIPTION</a></h1>
This program can read and write German DTAUS files. DTAUS is an semi-acronym for
  <b>D</b>aten<b>T</b>r&#x00E4;ger<b>AUS</b>tausch. It is used by German credit
  institutes in order to manage mass money exchanges between customer accounts
  and credit institutes.
<div style="height: 1.00em;">&#x00A0;</div>
Due to its limited availability and usefulness most of the documentation is held
  in German. This program is only useful in Germany or for companies that act in
  Germany.
<div style="height: 1.00em;">&#x00A0;</div>
For a complete description of the control file please refer to <i>dtaus.txt</i>
  and <b>dtaus</b>(5) from this distribution.
<h1 class="Sh" title="Sh" id="OPTIONS"><a class="selflink" href="#OPTIONS">OPTIONS</a></h1>
You have to specify exactly one of <b>-dtaus</b> or <b>-control</b>.
<dl class="Bl-tag">
  <dt class="It-tag"><b>-dtaus</b></dt>
  <dd class="It-tag">Liest die Kontrolldatei ein und erzeugt daraus die
      Bankdatei sowie alle anderen ben&#x00F6;tigten Dateien.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-control</b></dt>
  <dd class="It-tag">Liest eine Bankdatei ein und erzeugt daraus die
      Kontrolldatei, dekodiert eine bereits erstellte Bankdatei.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-d</b><i> dtaus</i></dt>
  <dd class="It-tag">Explizite Angabe des Dateinamens f&#x00FC;r die Bankdatei.
      Voreingestellt ist <b>dtaus0.txt</b>, was von der Bank als einziger
      Dateiname auf der Diskette erwartet wird. F&#x00FC;r Testzwecke oder zur
      Weiterverarbeitung darf hier die spezielle Datei ``-'' angegeben werden,
      wodurch <b>dtaus</b> angewiesen wird, auf die Standardausgabe zu
      schreiben.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-c</b><i> control</i></dt>
  <dd class="It-tag">Explizite Angabe des Dateinamens der Steuerdatei.
      Voreingestellt ist <b>dtaus0.ctl</b>. Da dieser Name jedoch nur intern
      verwendet wird, ist er keinen Beschr&#x00E4;nkungen unterlegen. In dieser
      Datei befinden sich die gesamten visuell lesbaren Informationen f&#x00FC;r
      den Geldverkehr. Diese Datei mu&#x00DF; f&#x00FC;r die Bank in das
      spezielle DTAUS-Format konvertiert werden. Das geschieht mit dem Schalter
      <b>-dtaus</b>.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-b</b><i> begleit</i></dt>
  <dd class="It-tag">Explizite Angabe des Dateinamens des Begleitzettels.
      Voreingestellt ist <b>dtaus0.doc</b>. Da dieser Name jedoch nur intern
      verwendet wird, ist er keinen Beschr&#x00E4;nkungen unterlegen. Diese
      Datei mu&#x00DF; ausgedruckt und der Diskette unterschrieben beigelegt
      werden.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-l</b><i> [<i>begleit</i>]<i></i></i></dt>
  <dd class="It-tag">LaTeX-Ausgabe des Begleit-Zettels erw&#x00FC;nscht. Diese
      Datei wird normalerweise nicht geschrieben. Voreingestellt ist
      <b>dtaus0.tex</b> als Dateiname, es kann jedoch ein anderer angegeben
      werden. F&#x00FC;r die Compilierung wird <i>dtaus.cls</i> ben&#x00F6;tigt.
      Diesem Programm liegt eine einfache Implementierung bei, idealerweise wird
      jedoch eine lokal angepa&#x00DF;te Klasse verwendet, die Kopf- und
      Fu&#x00DF;zeilen mit Logos und Adressen realisiert.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-o</b><i> kontroll</i></dt>
  <dd class="It-tag">Explizite Angabe des Dateinamens f&#x00FC;r die
      Kontrolldatei. Voreingestellt ist <b>dtaus0.sik</b>. Da dieser Name jedoch
      nur intern verwendet wird, ist er keinen Beschr&#x00E4;nkungen unterlegen.
      Es ist ratsam, diese Datei gut aufzubewahren oder auszudrucken und
      abzuheften. Dieses ist neben der Steuer- und Bankdatei die einzige
      Aufschl&#x00FC;sselung des get&#x00E4;tigten Geldverkehrs.</dd>
</dl>
<h1 class="Sh" title="Sh" id="BESCHREIBUNG"><a class="selflink" href="#BESCHREIBUNG">BESCHREIBUNG</a></h1>
Deutsche Banken bieten f&#x00FC;r Gro&#x00DF;kunden oder Kunden mit vielen
  &#x00E4;hnlichen &#x00DC;berweisungen oder Bankeinz&#x00FC;gen (auch
  Lastschriften genannt) die M&#x00F6;glichkeit des papierlosen Geldverkehrs
  &#x00FC;ber den Beleglosen Datentr&#x00E4;geraustausch an. Hierbei wird nicht
  mehr f&#x00FC;r jede &#x00DC;berweisung oder jeden Einzug ein eigenes Formular
  ben&#x00F6;tigt, sondern zusammengeh&#x00F6;rige Auftr&#x00E4;ge werden in
  einer Massensendung verpackt gemeinsam verarbeitet.
<div style="height: 1.00em;">&#x00A0;</div>
Hier ist jedoch Vorsicht geboten, denn auf dem eigenen Konto erscheint lediglich
  eine einzige Kontobewegung. Wenn Geld eingezogen wird, enth&#x00E4;lt der
  Kontoauszug nur die Gesamtsumme, wenn Geld &#x00FC;berwiesen wird, ist auf dem
  Kontoauszug nur die Gesamtsumme notiert. Es ist daher immens wichtig, die
  Ursprungsdaten aufzubewahren bzw. die Kontrolldatei auszudrucken und
  abzuheften.
<div style="height: 1.00em;">&#x00A0;</div>
Um an diesem Verfahren teilzunehmen, das den Geldverkehr f&#x00FC;r
  Organisationen erheblich vereinfachen kann, mu&#x00DF; mit der jeweiligen Bank
  eine gesonderte Vereinbarung getroffen werden, in der die speziellen
  Bestimmungen f&#x00FC;r diesen Datentr&#x00E4;geraustausch akzeptiert werden.
<div style="height: 1.00em;">&#x00A0;</div>
Durch das einfache Format der Steuerdatei l&#x00E4;&#x00DF;t sich dieses
  Verfahren leicht mit einer Datenbank oder einem gr&#x00F6;&#x00DF;eren
  Programm koppeln. In der Tat entstand das Programm nach Aufbau des ersten
  Wohnheimnetzes in Oldenburg (Oldbg.) und der ern&#x00FC;chternden Erkenntnis,
  da&#x00DF; die vom Kassenwart verwendeten Programme f&#x00FC;r den
  Datentr&#x00E4;geraustausch weder zuverl&#x00E4;ssig noch nachvollziehbar
  arbeiteten und somit Ersatz geschaffen werden mu&#x00DF;te. Die technische und
  finanzielle Verwaltung des Wohnheimnetzes fand &#x00FC;ber ein Linux-System
  mit Datenbankanbindung sowie <b>dtaus</b> statt.
<h1 class="Sh" title="Sh" id="BESONDERHEITEN"><a class="selflink" href="#BESONDERHEITEN">BESONDERHEITEN</a></h1>
Bei der Verwendung dieses Programms m&#x00FC;ssen wenigstens die folgenden Dinge
  beachtet werden, es sind Vorgaben von den beteiligten Banken.
<dl class="Bl-tag">
  <dt class="It-tag">1.</dt>
  <dd class="It-tag">Die Diskette mu&#x00DF; mit dem MSDOS-Dateisystem
      beschrieben sein.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">2.</dt>
  <dd class="It-tag">Auf einer Diskette darf nur eine einzige DTAUS-Datei
      enthalten sein, die den Dateinamen <b>DTAUS0.TXT</b> tr&#x00E4;gt.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">3.</dt>
  <dd class="It-tag">Der Diskette mu&#x00DF; ein Begleitzettel beigelegt werden,
      der einige Angaben erneut enth&#x00E4;lt sowie pers&#x00F6;nlich
      unterschrieben ist. Dieser Begleitzettel wird von <b>dtaus</b> automatisch
      erzeugt und voreingestellt in der Datei <b>dtaus0.doc</b> gespeichert, die
      nur noch ausgedruckt und unterschrieben werden mu&#x00DF;.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">4.</dt>
  <dd class="It-tag">Um den Beleglosen Datentr&#x00E4;geraustausch nutzen zu
      k&#x00F6;nnen, mu&#x00DF; vorher eine Zusatzvereinbarung mit der Bank
      getroffen werden.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">5.</dt>
  <dd class="It-tag">Die Angaben zum Verwendungszweck haben sich
      ausschlie&#x00DF;lich auf den jeweiligen Zahlungsverkehrsvorgang zu
      beziehen. Verwendungszweckangaben d&#x00FC;rfen nicht die
      &#x00DC;bermittlung einer gesonderten Nachricht au&#x00DF;erhalb des
      Zahlungsverkehrs (z.B. Rechnung, Lohn- und Gehaltsabrechnung) ersetzen.
      Werbetexte d&#x00FC;rfen in den Verwendungszweckangaben nicht enthalten
      sein.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">6.</dt>
  <dd class="It-tag">Der Kunde ist verpflichtet, den Inhalt der von ihm
      gelieferten Datentr&#x00E4;ger mindestens f&#x00FC;r einen Zeitraum von
      zehn Kalendertagen ab Einlieferung in der Form nachweisbar zu halten,
      da&#x00DF; dem Institut auf Anforderung kurzfristig besonders
      gekennzeichnete Duplikatsdatentr&#x00E4;ger geliefert werden
      k&#x00F6;nnen.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">7.</dt>
  <dd class="It-tag">Der R&#x00FC;ckruf eines Datentr&#x00E4;gers ist
      ausgeschlossen, sobald das Kreditinstitut mit dessen Verarbeitung begonnen
      hat. Einzelne &#x00DC;berweisungen und Lastschriften k&#x00F6;nnen nach
      Verarbeitung eines Datentr&#x00E4;gers nur au&#x00DF;erhalb des
      Datentr&#x00E4;geraustauschverfahrens zur&#x00FC;ckgerufen werden.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">8.</dt>
  <dd class="It-tag">Das Kreditinstitut f&#x00FC;hrt Konsistenzpr&#x00FC;fungen
      der auf dem Datentr&#x00E4;ger gespeicherten Datei durch. Schl&#x00E4;gt
      diese fehl, k&#x00F6;nnen einzelne Datens&#x00E4;tze von der Bearbeitung
      ausgeschlossen oder der gesamte Auftrag verworfen werden.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">9.</dt>
  <dd class="It-tag">Ergeben sich bei der Kontrolle der Datentr&#x00E4;ger durch
      das Kreditinstitut Fehler, so wird es die fehlerhaften Datens&#x00E4;tze
      in ihrem vollst&#x00E4;ndigen Inhalt nachweisen und sie dem Kunden
      unverz&#x00FC;glich mitteilen.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">10.</dt>
  <dd class="It-tag">Das Kreditinstitut gibt dem Kunden die von ihm erhaltenen
      Datentr&#x00E4;ger zur&#x00FC;ck. Sie k&#x00F6;nnen meistens schon am
      n&#x00E4;chsten Werktag in der Filiale abgeholt werden.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">11.</dt>
  <dd class="It-tag">Gutschriften und Belastungen, die auf einem an den Kunden
      ausgelieferten Datentr&#x00E4;ger enthalten sind, werden als
      Sammelbuchungen auf dem Konto des Kunden gebucht.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag">12.</dt>
  <dd class="It-tag">In einer Bankdatei kann ein Ausf&#x00FC;hrungsdatum
      angegeben werden, wenn die Bearbeitung der Diskette zu einem
      sp&#x00E4;teren Zeitpunkt als der Abgabe der Datei gew&#x00FC;nscht wird.
      Dieses Datum darf jedoch nicht j&#x00FC;nger als das Erstellungsdatum
      (wird automatisch von <b>dtaus</b> eingef&#x00FC;gt) sein und
      h&#x00F6;chstens 15 Kalendertage &#x00FC;ber dem Erstellungsdatum
    liegen.</dd>
</dl>
<h1 class="Sh" title="Sh" id="RETURN_VALUES"><a class="selflink" href="#RETURN_VALUES">RETURN
  VALUES</a></h1>
On success, zero is returned. On error, 1 is returned.
<h1 class="Sh" title="Sh" id="SEE_ALSO"><a class="selflink" href="#SEE_ALSO">SEE
  ALSO</a></h1>
<b>dtaus</b>(5).
<div style="height: 1.00em;">&#x00A0;</div>
DTAUS files use a special but simple and publically documented format. It is
  included in the distribution of <b>dtaus</b> as <i>dtaus.txt</i>.</div>
<table class="foot">
  <tr>
    <td class="foot-date">17 November 2001</td>
    <td class="foot-os"></td>
  </tr>
</table>
</body>
</html>
