<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8"/>
  <style>
    table.head, table.foot { width: 100%; }
    td.head-rtitle, td.foot-os { text-align: right; }
    td.head-vol { text-align: center; }
    div.Pp { margin: 1ex 0ex; }
  </style>
  <title>INKSCAPE(1)</title>
</head>
<body>
<table class="head">
  <tr>
    <td class="head-ltitle">INKSCAPE(1)</td>
    <td class="head-vol">Inkscape</td>
    <td class="head-rtitle">INKSCAPE(1)</td>
  </tr>
</table>
<div class="manual-text">
<h1 class="Sh" title="Sh" id="&#x540D;&#x524D;"><a class="selflink" href="#&#x540D;&#x524D;">&#x540D;&#x524D;</a></h1>
Inkscape - SVG (Scalable Vector Graphics)
  &#x7DE8;&#x96C6;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;
<h1 class="Sh" title="Sh" id="&#x66F8;&#x5F0F;"><a class="selflink" href="#&#x66F8;&#x5F0F;">&#x66F8;&#x5F0F;</a></h1>
&quot;inkscape [options] [filename ...]&quot;
<div class="Pp"></div>
options:
<div class="Pp"></div>
<pre>
    -?, --help        
        --usage       
    -V, --version
    -f, --file=FILENAME               
    -e, --export-png=FILENAME         
    -a, --export-area=x0:y0:x1:y1     
    -C, --export-area-page
    -D, --export-area-drawing
        --export-area-snap
    -i, --export-id=ID     
    -j, --export-id-only     
    -t, --export-use-hints
    -b, --export-background=COLOR     
    -y, --export-background-opacity=VALUE     
    -d, --export-dpi=DPI              
    -w, --export-width=WIDTH          
    -h, --export-height=HEIGHT        
    -P, --export-ps=FILENAME
    -E, --export-eps=FILENAME
    -A, --export-pdf=FILENAME
        --export-pdf-version=VERSION-STRING
        --export-latex
    --export-ps-level {2,3}
    -T, --export-text-to-path
        --export-ignore-filters
    -l, --export-plain-svg=FILENAME             
    -p, --print=PRINTER
    -I, --query-id=ID     
    -X, --query-x
    -Y, --query-y
    -W, --query-width
    -H, --query-height
    -S, --query-all
    -x, --extension-directory
        --verb-list
        --verb=VERB-ID
        --select=OBJECT-ID
        --shell
    -g, --with-gui                    
    -z, --without-gui                 
        --vacuum-defs
        --g-fatal-warnings
</pre>
<h1 class="Sh" title="Sh" id="&#x8AAC;&#x660E;"><a class="selflink" href="#&#x8AAC;&#x660E;">&#x8AAC;&#x660E;</a></h1>
<b>Inkscape</b> &#x306F; <b>Adobe
  Illustrator</b>&#x3001;<b>CorelDraw</b>&#x3001; <b>Xara Xtreme</b>
  &#x306A;&#x3069;&#x3068;&#x540C;&#x7B49;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x6301;&#x3064;
  <b>Scalable Vector Graphics (SVG)</b>
  &#x5F62;&#x5F0F;&#x306E;&#x63CF;&#x753B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x7528;
  GUI &#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x30FC;&#x3067;&#x3059;&#x3002;Inkscape
  &#x306F;&#x591A;&#x5F69;&#x306A;&#x30B7;&#x30A7;&#x30A4;&#x30D7;&#x3001;&#x30D9;&#x30B8;&#x30A8;&#x30D1;&#x30B9;&#x3001;&#x30D5;&#x30EA;&#x30FC;&#x30CF;&#x30F3;&#x30C9;&#x63CF;&#x753B;&#x3001;&#x8907;&#x6570;&#x884C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3001;&#x30D1;&#x30B9;&#x4E0A;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3001;&#x30A2;&#x30EB;&#x30D5;&#x30A1;&#x30D6;&#x30EC;&#x30F3;&#x30C7;&#x30A3;&#x30F3;&#x30B0;&#x3001;&#x4EFB;&#x610F;&#x306E;&#x30A2;&#x30D5;&#x30A3;&#x30F3;&#x5909;&#x63DB;&#x3001;&#x30B0;&#x30E9;&#x30C7;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304A;&#x3088;&#x3073;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x30D5;&#x30A3;&#x30EB;&#x3001;&#x30CE;&#x30FC;&#x30C9;&#x7DE8;&#x96C6;&#x3001;PNG
  &#x3084; PDF
  &#x3092;&#x542B;&#x3080;&#x591A;&#x304F;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x5F62;&#x5F0F;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30A4;&#x30F3;&#x30DD;&#x30FC;&#x30C8;&#x304A;&#x3088;&#x3073;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3001;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x5316;&#x3001;&#x30EC;&#x30A4;&#x30E4;&#x30FC;&#x3001;&#x30E9;&#x30A4;&#x30D6;&#x30AF;&#x30ED;&#x30FC;&#x30F3;&#x306A;&#x3069;&#x591A;&#x304F;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x5177;&#x5099;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x305D;&#x306E;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30D5;&#x30A7;&#x30A4;&#x30B9;&#x306F;&#x719F;&#x7DF4;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x3068;&#x3063;&#x3066;&#x5FEB;&#x9069;&#x3067;&#x52B9;&#x7387;&#x7684;&#x3067;&#x3042;&#x308B;&#x3068;&#x3068;&#x3082;&#x306B;&#x3001;
  <b>GNOME</b>
  &#x6A19;&#x6E96;&#x306B;&#x3082;&#x6E96;&#x62E0;&#x3059;&#x308B;&#x3088;&#x3046;&#x8A2D;&#x8A08;&#x3055;&#x308C;&#x3066;&#x3082;&#x3044;&#x308B;&#x305F;&#x3081;&#x3001;&#x4ED6;&#x306E;
  GNOME
  &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x3088;&#x304F;&#x77E5;&#x308B;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x3067;&#x3042;&#x308C;&#x3070;&#x6163;&#x308C;&#x308B;&#x307E;&#x3067;&#x306B;&#x591A;&#x304F;&#x306E;&#x6642;&#x9593;&#x3092;&#x5FC5;&#x8981;&#x3068;&#x3057;&#x307E;&#x305B;&#x3093;&#x3002;
<div class="Pp"></div>
<b>SVG</b> &#x306F; W3C &#x6A19;&#x6E96;&#x306E; 2D
  &#x30D9;&#x30AF;&#x30BF;&#x30FC;&#x30B0;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x7528;
  XML
  &#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30C3;&#x30C8;&#x3067;&#x3059;&#x3002;&#x63CF;&#x753B;&#x5185;&#x3067;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x3001;&#x30D1;&#x30B9;&#x3001;&#x304A;&#x3088;&#x3073;&#x57FA;&#x672C;&#x30B7;&#x30A7;&#x30A4;&#x30D7;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x5B9A;&#x7FA9;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x914D;&#x8272;&#x3001;&#x30D5;&#x30A9;&#x30F3;&#x30C8;&#x3001;&#x30B9;&#x30C8;&#x30ED;&#x30FC;&#x30AF;&#x5E45;&#x306A;&#x3069;&#x306F;
  `style'
  &#x5C5E;&#x6027;&#x3068;&#x3057;&#x3066;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;SVG
  &#x306F;&#x3001;&#x6A19;&#x6E96;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x3001;&#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;
  text/xml
  &#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x610F;&#x56F3;&#x3057;&#x3066;&#x3044;&#x308B;&#x305F;&#x3081;&#x3001;&#x591A;&#x304F;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3068;&#x3001;&#x305D;&#x3057;&#x3066;&#x5E45;&#x5E83;&#x3044;&#x7528;&#x9014;&#x3067;&#x306E;&#x5229;&#x7528;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;
<div class="Pp"></div>
<b>Inkscape</b> &#x306F; SVG
  &#x3092;&#x305D;&#x306E;&#x5185;&#x90E8;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30C3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x63A1;&#x7528;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30DF;&#x30E5;&#x30CB;&#x30C6;&#x30A3;&#x306B;&#x304A;&#x3044;&#x3066;&#x3082;&#x3063;&#x3068;&#x3082;
  SVG
  &#x306B;&#x6E96;&#x62E0;&#x3057;&#x305F;&#x30C9;&#x30ED;&#x30FC;&#x30A4;&#x30F3;&#x30B0;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306B;&#x306A;&#x308B;&#x3053;&#x3068;&#x3092;&#x76EE;&#x6A19;&#x3068;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
<h1 class="Sh" title="Sh" id="&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;"><a class="selflink" href="#&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;">&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;</a></h1>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-?</b>, <b>--help</b></dt>
  <dd class="It-tag">&#x30D8;&#x30EB;&#x30D7;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-V</b>, <b>--version</b></dt>
  <dd class="It-tag">Inkscape
      &#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3068;&#x30D3;&#x30EB;&#x30C9;&#x65E5;&#x6642;&#x3092;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-a</b> <i>x0:y0:x1:y1</i>,
    <b>--export-area</b>=<i>x0:y0:x1:y1</i></dt>
  <dd class="It-tag">PNG
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x9818;&#x57DF;&#x3092;
      SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D; (&#x901A;&#x5E38;
      Inkscape SVG
      &#x5185;&#x3067;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x9577;&#x3055;&#x306E;&#x5358;&#x4F4D;)
      &#x3067;&#x6307;&#x5B9A;&#x3057;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x5168;&#x4F53;&#x3092;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x307E;&#x3059;&#x3002;&#x5EA7;&#x6A19;
      (0,0)
      &#x306F;&#x5DE6;&#x4E0B;&#x306E;&#x89D2;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-C</b>, <b>--export-area-page</b></dt>
  <dd class="It-tag">PNG&#x3001;PDF&#x3001;PS&#x3001;&#x304A;&#x3088;&#x3073;
      EPS
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x306F;&#x305D;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;
      PNG&#x3001;PDF&#x3001;&#x304A;&#x3088;&#x3073; PS
      &#x3067;&#x306F;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306B;&#x306A;&#x308B;&#x305F;&#x3081;&#x3001;--export-id
      &#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x6307;&#x5B9A;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x5834;&#x5408;&#x3092;&#x9664;&#x304D;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x5BFE;&#x3057;&#x3066;
      EPS
      &#x3067;&#x306F;&#x3053;&#x308C;&#x306F;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306B;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3055;&#x3089;&#x306B;
      EPS
      &#x3067;&#x306F;&#x3001;&#x5F62;&#x5F0F;&#x306E;&#x6307;&#x5B9A;&#x306B;&#x304A;&#x3044;&#x3066;&#x5883;&#x754C;&#x67A0;&#x3092;&#x5185;&#x5BB9;&#x3088;&#x308A;&#x62E1;&#x5927;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;EPS
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x6642;&#x306B;
      --export-area-page
      &#x3092;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;&#x30DA;&#x30FC;&#x30B8;&#x306E;&#x5185;&#x5BB9;&#x304C;&#x5883;&#x754C;&#x67A0;&#x3088;&#x308A;&#x5C0F;&#x3055;&#x3044;&#x3068;&#x5883;&#x754C;&#x67A0;&#x3082;&#x305D;&#x308C;&#x306B;&#x5408;&#x308F;&#x305B;&#x3066;&#x5C0F;&#x3055;&#x304F;&#x306A;&#x308B;&#x3053;&#x3068;&#x3092;&#x610F;&#x5473;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-D</b>, <b>--export-area-drawing</b></dt>
  <dd class="It-tag">PNG&#x3001;PDF&#x3001;PS&#x3001;&#x304A;&#x3088;&#x3073;
      EPS
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x308B;&#x9818;&#x57DF;&#x306F;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x305D;&#x306E;&#x63CF;&#x753B;&#x90E8;&#x5206;&#x3001;&#x3059;&#x306A;&#x308F;&#x3061;&#x3001;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x5185;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;
      (--export-id
      &#x3092;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;)
      &#x5168;&#x4F53;&#x306E;&#x5883;&#x754C;&#x67A0;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x3001;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x305F;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x306B;&#x306F;&#x30DE;&#x30FC;&#x30B8;&#x30F3;&#x3084;&#x30AF;&#x30ED;&#x30C3;&#x30D4;&#x30F3;&#x30B0;&#x304C;&#x306A;&#x304F;&#x3001;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x53EF;&#x8996;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304C;&#x542B;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;EPS
      &#x3067;&#x306F;&#x3053;&#x308C;&#x304C;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x3068;&#x306A;&#x308A;&#x3001;--export-use-hints
      &#x3068;&#x3068;&#x3082;&#x306B;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-area-snap</b></dt>
  <dd class="It-tag">PNG
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x3092;&#x62E1;&#x5927;&#x65B9;&#x5411;&#x306B;&#x6700;&#x3082;&#x8FD1;&#x3044;
      SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D; (px)
      &#x5024;&#x306B;&#x30B9;&#x30CA;&#x30C3;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x89E3;&#x50CF;&#x5EA6;&#x304C;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;
      90dpi
      &#x3067;&#x30B0;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x304C;&#x6700;&#x5C0F;&#x306E;&#x30A2;&#x30F3;&#x30C1;&#x30A8;&#x30A4;&#x30EA;&#x30A2;&#x30B9;&#x306B;&#x30D4;&#x30AF;&#x30BB;&#x30EB;&#x30B9;&#x30CA;&#x30C3;&#x30D7;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x3001;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x5883;&#x754C;&#x67A0;
      (--export-id &#x307E;&#x305F;&#x306F; --export-area-drawing
      &#x6307;&#x5B9A;)
      &#x304C;&#x30D4;&#x30AF;&#x30BB;&#x30EB;&#x306B;&#x63C3;&#x3048;&#x3066;&#x3044;&#x306A;&#x3044;&#x5834;&#x5408;&#x3067;&#x3042;&#x3063;&#x3066;&#x3082;&#x3001;&#x3053;&#x306E;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x3067;&#x914D;&#x7F6E;&#x3092;&#x7DAD;&#x6301;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-b</b> <i>COLOR</i>,
    <b>--export-background</b>=<i>COLOR</i></dt>
  <dd class="It-tag">&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x305F;
      PNG
      &#x306E;&#x80CC;&#x666F;&#x8272;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;SVG
      &#x304C;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x8272;&#x6307;&#x5B9A;&#x6587;&#x5B57;&#x5217;
      (&quot;#ff007f&quot; &#x3084; &quot;rgb(255,0,128)&quot; &#x306A;&#x3069;)
      &#x304C;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#x3001;Inkscape
      &#x306E;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x306E;&#x8A2D;&#x5B9A;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x8272;
      (sodipodi:namedview &#x306E; pagecolor= &#x5C5E;&#x6027;)
      &#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-d</b> <i>DPI</i>, <b>--export-dpi</b>=<i>DPI</i></dt>
  <dd class="It-tag">PNG
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x89E3;&#x50CF;&#x5EA6;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;PS&#x3001;EPS&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;
      PDF
      &#x3078;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x6642;&#x306E;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30FC;&#x51E6;&#x7406;&#x3055;&#x308C;&#x305F;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x304A;&#x3051;&#x308B;&#x30D5;&#x30A9;&#x30FC;&#x30EB;&#x30D0;&#x30C3;&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x30E9;&#x30A4;&#x30BA;&#x3067;&#x3082;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;
      (--export-ignore-filters
      &#x3067;&#x30E9;&#x30B9;&#x30BF;&#x30E9;&#x30A4;&#x30BA;&#x3092;&#x6291;&#x6B62;&#x3057;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x3092;&#x9664;&#x304F;)&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-e</b> <i>FILENAME</i>,
    <b>--export-png</b>=<i>FILENAME</i></dt>
  <dd class="It-tag">PNG
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x6642;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x307E;&#x3059;&#x3002;&#x540C;&#x540D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x5B58;&#x5728;&#x3059;&#x308B;&#x5834;&#x5408;&#x3001;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x306A;&#x3057;&#x306B;&#x4E0A;&#x66F8;&#x304D;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-f</b> <i>FILENAME</i>,
    <b>--file</b>=<i>FILENAME</i></dt>
  <dd class="It-tag">&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x958B;&#x304D;&#x307E;&#x3059;&#x3002;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x6587;&#x5B57;
      (-f)
      &#x306F;&#x7701;&#x7565;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x3059;&#x306A;&#x308F;&#x3061;&#x3001;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x6587;&#x5B57;&#x304C;&#x4E0E;&#x3048;&#x3089;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;
      -f
      &#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x3001;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x30FC;&#x306F;&#x3059;&#x3079;&#x3066;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3068;&#x307F;&#x306A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-g</b>, <b>--with-gui</b></dt>
  <dd class="It-tag">GUI
      &#x306E;&#x4F7F;&#x7528;&#x3092;&#x8A66;&#x307F;&#x307E;&#x3059; (Unix
      &#x306E;&#x5834;&#x5408;&#x3001;$DISPLAY
      &#x304C;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x5834;&#x5408;&#x3067;&#x3082;
      X server &#x3092;&#x4F7F;&#x7528;&#x3057;&#x307E;&#x3059;)&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-h</b> <i>HEIGHT</i>,
    <b>--export-height</b>=<i>HEIGHT</i></dt>
  <dd class="It-tag">&#x751F;&#x6210;&#x3059;&#x308B;&#x30D3;&#x30C3;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x306E;&#x9AD8;&#x3055;
      (&#x30D4;&#x30AF;&#x30BB;&#x30EB;)
      &#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x5024;&#x306F;
      --export-dpi &#x8A2D;&#x5B9A; (&#x307E;&#x305F;&#x306F; --export-use-hints
      &#x3092;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x5834;&#x5408;&#x306E; DPI
      &#x30D2;&#x30F3;&#x30C8;)
      &#x3088;&#x308A;&#x512A;&#x5148;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-i</b> <i>ID</i>, <b>--export-id</b>=<i>ID</i></dt>
  <dd class="It-tag">For PNG, PS, EPS, PDF and plain SVG export, the id
      attribute value of the object that you want to export from the document;
      all other objects are not exported. By default the exported area is the
      bounding box of the object; you can override this using --export-area (PNG
      only) or --export-area-page.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-j</b>, <b>--export-id-only</b></dt>
  <dd class="It-tag">For PNG and plain SVG, only export the object whose id is
      given in --export-id. All other objects are hidden and won't show in
      export even if they overlay the exported object. Without --export-id, this
      option is ignored. For PDF export, this is the default, so this option has
      no effect.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-l</b>, <b>--export-plain-svg</b>=<i>FILENAME</i></dt>
  <dd class="It-tag">&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x30D7;&#x30EC;&#x30FC;&#x30F3;
      SVG
      &#x5F62;&#x5F0F;&#x306B;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x307E;&#x3059;&#x3002;sodipodi:
      &#x3042;&#x308B;&#x3044;&#x306F; inkscape:
      &#x540D;&#x524D;&#x7A7A;&#x9593;&#x3084; RDF
      &#x30E1;&#x30BF;&#x30C7;&#x30FC;&#x30BF;&#x306F;&#x7834;&#x68C4;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-x</b>, <b>--extension-directory</b></dt>
  <dd class="It-tag">Inkscape
      &#x304C;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3088;&#x3046;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x73FE;&#x5728;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30C6;&#x30F3;&#x30B7;&#x30E7;&#x30F3;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x306E;&#x4E00;&#x89A7;&#x3092;&#x8868;&#x793A;&#x3057;&#x3066;&#x7D42;&#x4E86;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x5916;&#x90E8;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30C6;&#x30F3;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;
      Inkscape
      &#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x5834;&#x6240;&#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--verb-list</b></dt>
  <dd class="It-tag">Inkscape
      &#x3067;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;&#x5168; VERB
      (&#x5185;&#x90E8;&#x30B3;&#x30DE;&#x30F3;&#x30C9;)
      &#x306E;&#x4E00;&#x89A7;&#x3092; ID
      &#x9806;&#x3067;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;
      ID
      &#x306F;&#x30AD;&#x30FC;&#x30DE;&#x30C3;&#x30D7;&#x3084;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306E;&#x5B9A;&#x7FA9;&#x3067;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x4ED6;&#x3001;--verb
      &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3082;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--verb</b>=<i>VERB-ID</i>,
    <b>--select</b>=<i>OBJECT-ID</i></dt>
  <dd class="It-tag">&#x3053;&#x308C;&#x3089; 2
      &#x3064;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x540C;&#x6642;&#x306B;&#x4F7F;&#x7528;&#x3057;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x304B;&#x3089;
      Inkscape
      &#x3092;&#x64CD;&#x4F5C;&#x3067;&#x304D;&#x308B;&#x57FA;&#x672C;&#x7684;&#x306A;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x6A5F;&#x80FD;&#x3092;&#x63D0;&#x4F9B;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x306F;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x4E0A;&#x3067;&#x3001;&#x5FC5;&#x8981;&#x3067;&#x3042;&#x308C;&#x3070;&#x4F55;&#x5EA6;&#x3067;&#x3082;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x3001;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5404;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x4E0A;&#x3067;&#x9806;&#x756A;&#x306B;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;
    <div style="height: 1.00em;">&#x00A0;</div>
    --verb
      &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;
      VERB
      &#x3092;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x3084;&#x30DC;&#x30BF;&#x30F3;&#x304B;&#x3089;&#x547C;&#x3073;&#x51FA;&#x3057;&#x305F;&#x5834;&#x5408;&#x3068;&#x540C;&#x69D8;&#x306B;&#x5B9F;&#x884C;&#x3057;&#x307E;&#x3059;&#x3002;VERB
      &#x306B;&#x30C0;&#x30A4;&#x30A2;&#x30ED;&#x30B0;&#x304C;&#x3042;&#x308B;&#x5834;&#x5408;&#x306F;&#x305D;&#x308C;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x308B;
      VERB ID &#x306E;&#x4E00;&#x89A7;&#x306F; --verb-list
      &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
    <div style="height: 1.00em;">&#x00A0;</div>
    --select
      &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;
      ID
      &#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x9078;&#x629E;&#x72B6;&#x614B;&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;&#x69D8;&#x3005;&#x306A;
      VERB
      &#x306F;&#x3053;&#x3053;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3059;&#x3079;&#x3066;&#x306E;&#x9078;&#x629E;&#x3092;&#x89E3;&#x9664;&#x3059;&#x308B;&#x306B;&#x306F;
      --verb=EditDeselect
      &#x3092;&#x4F7F;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;
      ID
      &#x306F;&#x8AAD;&#x307F;&#x8FBC;&#x307E;&#x308C;&#x308B;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x306B;&#x4F9D;&#x5B58;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-p</b> <i>PRINTER</i>,
    <b>--print</b>=<i>PRINTER</i></dt>
  <dd class="It-tag">&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;
      `lpr -P PRINTER'
      &#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x30D7;&#x30EA;&#x30F3;&#x30BF;&#x30FC;&#x3067;&#x5370;&#x5237;&#x3057;&#x307E;&#x3059;&#x3002;&#x4ED6;&#x306B;&#x3001;`|
      COMMAND'
      &#x3067;&#x3055;&#x307E;&#x3056;&#x307E;&#x306A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3078;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3057;&#x3001;`&gt;
      FILENAME' &#x3067; PostScript
      &#x51FA;&#x529B;&#x3067;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x66F8;&#x304D;&#x51FA;&#x3057;&#x307E;&#x3059;&#x3002;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x30B7;&#x30A7;&#x30EB;&#x306B;&#x5FDC;&#x3058;&#x305F;&#x5F15;&#x7528;&#x7B26;&#x3067;&#x62EC;&#x308B;&#x3053;&#x3068;&#x3092;&#x5FD8;&#x308C;&#x306A;&#x3044;&#x3067;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;
    <div style="height: 1.00em;">&#x00A0;</div>
    &#x4F8B;: inkscape --print='| ps2pdf - mydoc.pdf' mydoc.svg</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-t</b>, <b>--export-use-hints</b></dt>
  <dd class="It-tag">&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x305F;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x4FDD;&#x5B58;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x304A;&#x3088;&#x3073;
      DPI
      &#x30D2;&#x30F3;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x307E;&#x3059;
      (--export-id
      &#x4F7F;&#x7528;&#x6642;&#x306E;&#x307F;)&#x3002;&#x3053;&#x308C;&#x3089;&#x30D2;&#x30F3;&#x30C8;&#x306F;
      Inkscape
      &#x5185;&#x304B;&#x3089;&#x9078;&#x629E;&#x7BC4;&#x56F2;&#x3092;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3068;&#x304D;&#x306B;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3059;&#x306A;&#x308F;&#x3061;&#x3001;&#x4F8B;&#x3048;&#x3070;
      Inkscape
      &#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;
      document.svg
      &#x304B;&#x3089;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8; ID
      &quot;path231&quot; &#x3092; /home/me/shape.png
      &#x306B;&#x89E3;&#x50CF;&#x5EA6; 300dpi
      &#x3067;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3001;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x4FDD;&#x5B58;&#x3059;&#x308C;&#x3070;&#x3001;&#x305D;&#x306E;&#x30B7;&#x30A7;&#x30A4;&#x30D7;&#x3092;&#x540C;&#x3058;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3067;&#x540C;&#x3058;&#x89E3;&#x50CF;&#x5EA6;&#x3067;&#x518D;&#x5EA6;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x6307;&#x5B9A;&#x3060;&#x3051;&#x3067;&#x884C;&#x3048;&#x307E;&#x3059;&#x3002;
    <div style="height: 1.00em;">&#x00A0;</div>
    inkscape -i path231 -t document.svg
    <div style="height: 1.00em;">&#x00A0;</div>
    --export-dpi&#x3001;--export-width&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;
      --export-height
      &#x3092;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x5171;&#x306B;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;DPI
      &#x30D2;&#x30F3;&#x30C8;&#x306F;&#x7121;&#x8996;&#x3055;&#x308C;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5024;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;--export-png
      &#x3092;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x5171;&#x306B;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x30D2;&#x30F3;&#x30C8;&#x306F;&#x7121;&#x8996;&#x3055;&#x308C;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-w</b> <i>WIDTH</i>,
    <b>--export-width</b>=<i>WIDTH</i></dt>
  <dd class="It-tag">&#x751F;&#x6210;&#x3055;&#x308C;&#x308B;&#x30D3;&#x30C3;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x306E;&#x5E45;&#x306E;&#x30D4;&#x30AF;&#x30BB;&#x30EB;&#x6570;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x5024;&#x306F;
      --export-dpi &#x6307;&#x5B9A; (--export-use-hints
      &#x3092;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F; DPI
      &#x30D2;&#x30F3;&#x30C8;)
      &#x3088;&#x308A;&#x512A;&#x5148;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-y</b> <i>VALUE</i>,
    <b>--export-background-opacity</b>=<i>VALUE</i></dt>
  <dd class="It-tag">&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x305F;
      PNG
      &#x306E;&#x80CC;&#x666F;&#x306E;&#x900F;&#x660E;&#x5EA6;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x5024;&#x306E;&#x7BC4;&#x56F2;&#x306F;
      0.0 &#x304B;&#x3089; 1.0 (0.0
      &#x304C;&#x5B8C;&#x5168;&#x306A;&#x900F;&#x660E;&#x3001;1.0
      &#x304C;&#x5B8C;&#x5168;&#x306A;&#x4E0D;&#x900F;&#x660E;)&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;
      1 &#x304B;&#x3089; 255 (255
      &#x304C;&#x5B8C;&#x5168;&#x306A;&#x4E0D;&#x900F;&#x660E;)
      &#x306E;&#x3069;&#x3061;&#x3089;&#x304B;&#x3067;&#x3059;&#x3002;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x6307;&#x5B9A;&#x305B;&#x305A;
      -b
      &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3082;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x5834;&#x5408;&#x3001;
      Inkscape
      &#x5185;&#x306E;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x306E;&#x8A2D;&#x5B9A;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5024;
      (sodipodi:namedview &#x306E; inkscape:pageopacity=
      &#x5C5E;&#x6027;)&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x6307;&#x5B9A;&#x305B;&#x305A;&#x306B;
      -b
      &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x3001;255
      (&#x5B8C;&#x5168;&#x306A;&#x4E0D;&#x900F;&#x660E;)
      &#x3068;&#x307F;&#x306A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-P</b> <i>FILENAME</i>,
    <b>--export-ps</b>=<i>FILENAME</i></dt>
  <dd class="It-tag">&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;
      PostScript (PS)
      &#x5F62;&#x5F0F;&#x306B;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x307E;&#x3059;&#x3002;PostScript
      &#x306F;&#x900F;&#x660E;&#x5EA6;&#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x70B9;&#x306B;&#x7559;&#x610F;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;
      SVG
      &#x306B;&#x3042;&#x308B;&#x3044;&#x304B;&#x306A;&#x308B;&#x900F;&#x660E;&#x306A;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3082;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x30E9;&#x30B9;&#x30BF;&#x30E9;&#x30A4;&#x30BA;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A9;&#x30F3;&#x30C8;&#x306F;&#x30B5;&#x30D6;&#x30BB;&#x30C3;&#x30C8;&#x5316;&#x3055;&#x308C;&#x3066;&#x57CB;&#x3081;&#x8FBC;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x306F;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x306A;&#x308A;&#x3001;--export-area-drawing
      &#x3067;&#x63CF;&#x753B;&#x5168;&#x4F53;&#x306B;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;--export-id
      &#x3067;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;
      1 &#x3064;&#x6307;&#x5B9A;&#x3067;&#x304D;
      (&#x305D;&#x306E;&#x4ED6;&#x306F;&#x3059;&#x3079;&#x3066;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x307E;&#x305B;&#x3093;)&#x3001;&#x305D;&#x306E;&#x5834;&#x5408;&#x306F;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x306F;&#x305D;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x5883;&#x754C;&#x67A0;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x304C;&#x3001;--export-area-page
      &#x3067;&#x305D;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-E</b> <i>FILENAME</i>,
    <b>--export-eps</b>=<i>FILENAME</i></dt>
  <dd class="It-tag">&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;
      Encapsulated PostScript (EPS)
      &#x5F62;&#x5F0F;&#x306B;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x307E;&#x3059;&#x3002;PostScript
      &#x306F;&#x900F;&#x660E;&#x5EA6;&#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x70B9;&#x306B;&#x7559;&#x610F;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;
      SVG
      &#x306B;&#x3042;&#x308B;&#x3044;&#x304B;&#x306A;&#x308B;&#x900F;&#x660E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3082;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x30E9;&#x30B9;&#x30BF;&#x30E9;&#x30A4;&#x30BA;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A9;&#x30F3;&#x30C8;&#x306F;&#x30B5;&#x30D6;&#x30BB;&#x30C3;&#x30C8;&#x5316;&#x3055;&#x308C;&#x3066;&#x57CB;&#x3081;&#x8FBC;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x306F;&#x63CF;&#x753B;&#x5168;&#x4F53;&#x306B;&#x306A;&#x308A;&#x3001;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x51FA;&#x6765;&#x307E;&#x3059;&#x304C;&#x3001;&#x305D;&#x306E;&#x5834;&#x5408;&#x306E;&#x5236;&#x9650;&#x4E8B;&#x9805;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;
      --export-area-page
      &#x3092;&#x53C2;&#x7167;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;--export-id
      &#x3067;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;
      1 &#x3064;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x307E;&#x3059;
      (&#x305D;&#x306E;&#x4ED6;&#x306F;&#x3059;&#x3079;&#x3066;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x307E;&#x305B;&#x3093;)&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-A</b> <i>FILENAME</i>,
    <b>--export-pdf</b>=<i>FILENAME</i></dt>
  <dd class="It-tag">&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;
      PDF
      &#x5F62;&#x5F0F;&#x306B;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x5F62;&#x5F0F;&#x3067;&#x306F;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;
      SVG
      &#x306E;&#x900F;&#x660E;&#x5EA6;&#x306F;&#x4FDD;&#x6301;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A9;&#x30F3;&#x30C8;&#x306F;&#x30B5;&#x30D6;&#x30BB;&#x30C3;&#x30C8;&#x5316;&#x3055;&#x308C;&#x57CB;&#x3081;&#x8FBC;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x306F;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x306A;&#x308A;&#x3001;--export-area-drawing
      &#x3067;&#x63CF;&#x753B;&#x5168;&#x4F53;&#x306B;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;--export-id
      &#x3067;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;
      1 &#x3064;&#x6307;&#x5B9A;&#x3067;&#x304D;
      (&#x305D;&#x306E;&#x4ED6;&#x306F;&#x3059;&#x3079;&#x3066;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x307E;&#x305B;&#x3093;)&#x3001;&#x305D;&#x306E;&#x5834;&#x5408;&#x306F;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x306F;&#x305D;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x5883;&#x754C;&#x67A0;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x304C;&#x3001;--export-area-page
      &#x3067;&#x305D;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&quot;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-pdf-version</b>=<i>PDF-VERSION</i></dt>
  <dd class="It-tag">Select the PDF version of the exported PDF file. This
      option basically exposes the PDF version selector found in the PDF-export
      dialog of the GUI. You must provide one of the versions from that
      combo-box, e.g. &quot;1.4&quot;. The default pdf export version is
      &quot;1.4&quot;.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-latex</b></dt>
  <dd class="It-tag">(PS&#x3001;EPS&#x3001;&#x304A;&#x3088;&#x3073; PDF
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x7528;) LaTeX
      &#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x7528;&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3001;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x5185;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306F;
      LaTeX
      &#x306B;&#x3088;&#x308B;&#x30BF;&#x30A4;&#x30D7;&#x30BB;&#x30C3;&#x30C8;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;PDF/PS/EPS
      &#x5F62;&#x5F0F;&#x3078;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x6642;&#x3001;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;
      SVG &#x3092; PDF/PS/EPS &#x30D5;&#x30A1;&#x30A4;&#x30EB;
      (&#x5F62;&#x5F0F;&#x306F; --export-pdf
      &#x306A;&#x3069;&#x3067;&#x6307;&#x5B9A;) &#x3068; LaTeX
      &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x5206;&#x5272;&#x3057;&#x307E;&#x3059;&#x3002;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306F;
      PDF/PS/EPS
      &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x306F;&#x51FA;&#x529B;&#x3055;&#x308C;&#x305A;&#x3001;LaTeX
      &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;
      LaTeX &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x306F; PDF/PS/EPS
      &#x3082;&#x542B;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;LaTex
      &#x3067;&#x3053;&#x306E; LaTeX
      &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x5165;&#x529B;
      (\input{image.tex})
      &#x3059;&#x308B;&#x3068;&#x3001;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3068;&#x5171;&#x306B;
      LaTeX
      &#x306B;&#x3088;&#x3063;&#x3066;&#x30BF;&#x30A4;&#x30D7;&#x30BB;&#x30C3;&#x30C8;&#x3055;&#x308C;&#x305F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3088;&#x308A;&#x8A73;&#x3057;&#x3044;&#x60C5;&#x5831;&#x306F;&#x51FA;&#x529B;&#x3055;&#x308C;&#x305F;&#x5B9F;&#x969B;&#x306E;
      LaTeX
      &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x53C2;&#x7167;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#x307E;&#x305F;&#x3001;GNUPlot
      &#x306E; `epslatex'
      &#x51FA;&#x529B;&#x30BF;&#x30FC;&#x30DF;&#x30CA;&#x30EB;&#x3082;&#x53C2;&#x7167;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-T</b>, <b>--export-text-to-path</b></dt>
  <dd class="It-tag">&#x8A72;&#x5F53;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30D1;&#x30B9;&#x306B;&#x5909;&#x63DB;&#x3057;&#x307E;&#x3059;
      (PS&#x3001;EPS&#x3001;PDF&#x3001;&#x304A;&#x3088;&#x3073; SVG
      &#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x7528;)&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-ignore-filters</b></dt>
  <dd class="It-tag">&#x307C;&#x304B;&#x3057;&#x306A;&#x3069;&#x306E;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30FC;&#x304C;&#x9069;&#x7528;&#x3055;&#x308C;&#x305F;&#x30D9;&#x30AF;&#x30BF;&#x30FC;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3068;&#x304D;&#x3001;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30FC;&#x3092;&#x7121;&#x8996;&#x3057;&#x307E;&#x3059;
      (PS&#x3001;EPS&#x3001;&#x304A;&#x3088;&#x3073; PDF
      &#x7528;)&#x3002;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30FC;&#x304C;&#x9069;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306F;
      --export-dpi
      &#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x89E3;&#x50CF;&#x5EA6;
      (&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F; 90 dpi)
      &#x3067;&#x30E9;&#x30B9;&#x30BF;&#x30E9;&#x30A4;&#x30BA;&#x3055;&#x308C;&#x3001;&#x305D;&#x306E;&#x5916;&#x898B;&#x3092;&#x7DAD;&#x6301;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-I</b>, <b>--query-id</b></dt>
  <dd class="It-tag">&#x30B5;&#x30A4;&#x30BA;&#x3084;&#x5EA7;&#x6A19;&#x3092;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x305F;&#x3044;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;
      ID
      &#x3092;&#x6307;&#x5B9A;&#x3057;&#x307E;&#x3059;&#x3002;&#x6307;&#x5B9A;&#x304C;&#x306A;&#x3044;&#x5834;&#x5408;&#x3001;&#x30DA;&#x30FC;&#x30B8;&#x3084;
      viewBox
      &#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x63CF;&#x753B;&#x5168;&#x4F53;
      (&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x5185;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;)
      &#x306E;&#x60C5;&#x5831;&#x3092;&#x8FD4;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-X</b>, <b>--query-x</b></dt>
  <dd class="It-tag">&#x63CF;&#x753B;&#x5168;&#x4F53;&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;
      --query-id
      &#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x306F;&#x305D;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;
      X
      &#x5EA7;&#x6A19;&#x3092;&#x554F;&#x3044;&#x5408;&#x305B;&#x307E;&#x3059;&#x3002;&#x8FD4;&#x3055;&#x308C;&#x308B;&#x5024;&#x306E;&#x5358;&#x4F4D;&#x306F;
      px (SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D;)
      &#x3067;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-Y</b>, <b>--query-y</b></dt>
  <dd class="It-tag">&#x63CF;&#x753B;&#x5168;&#x4F53;&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;
      --query-id
      &#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x306F;&#x305D;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;
      Y
      &#x5EA7;&#x6A19;&#x3092;&#x554F;&#x3044;&#x5408;&#x305B;&#x307E;&#x3059;&#x3002;&#x8FD4;&#x3055;&#x308C;&#x308B;&#x5024;&#x306E;&#x5358;&#x4F4D;&#x306F;
      px (SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D;)
      &#x3067;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-W</b>, <b>--query-width</b></dt>
  <dd class="It-tag">&#x63CF;&#x753B;&#x5168;&#x4F53;&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;
      --query-id
      &#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x306F;&#x305D;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x5E45;&#x3092;&#x554F;&#x3044;&#x5408;&#x305B;&#x307E;&#x3059;&#x3002;&#x8FD4;&#x3055;&#x308C;&#x308B;&#x5024;&#x306E;&#x5358;&#x4F4D;&#x306F;
      px (SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D;)
      &#x3067;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-H</b>, <b>--query-height</b></dt>
  <dd class="It-tag">&#x63CF;&#x753B;&#x5168;&#x4F53;&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;
      --query-id
      &#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x306F;&#x305D;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x9AD8;&#x3055;&#x3092;&#x554F;&#x3044;&#x5408;&#x305B;&#x307E;&#x3059;&#x3002;&#x8FD4;&#x3055;&#x308C;&#x308B;&#x5024;&#x306E;&#x5358;&#x4F4D;&#x306F;
      px (SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D;)
      &#x3067;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-S</b>, <b>--query-all</b></dt>
  <dd class="It-tag">SVG
      &#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x5185;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x5B9A;&#x7FA9;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;
      ID&#x3001;X &#x5EA7;&#x6A19;&#x3001;Y
      &#x5EA7;&#x6A19;&#x3001;&#x5E45;&#x3001;&#x304A;&#x3088;&#x3073;&#x9AD8;&#x3055;&#x3092;&#x30B3;&#x30F3;&#x30DE;&#x3067;&#x533A;&#x5207;&#x3063;&#x305F;&#x4E00;&#x89A7;&#x3092;&#x51FA;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--shell</b></dt>
  <dd class="It-tag">&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x3001;Inkscape
      &#x306F;&#x5BFE;&#x8A71;&#x5F0F;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30B7;&#x30A7;&#x30EB;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x8D77;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x306F;&#x3001;&#x30D7;&#x30ED;&#x30F3;&#x30D7;&#x30C8;&#x3067;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x3068;
      Inkscape
      &#x306F;&#x305D;&#x308C;&#x3089;&#x3092;&#x5B9F;&#x884C;&#x3057;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3054;&#x3068;&#x306B;&#x65B0;&#x3057;&#x304F;
      Inkscape
      &#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x306E;&#x30E2;&#x30FC;&#x30C9;&#x306F;&#x4E3B;&#x306B;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x4F5C;&#x6210;&#x3084;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x7528;&#x9014;&#x3067;&#x5F79;&#x7ACB;&#x3061;&#x307E;&#x3059;&#x3002;&#x3053;&#x3053;&#x3067;&#x306A;&#x306B;&#x304B;&#x65B0;&#x3057;&#x3044;&#x6A5F;&#x80FD;&#x304C;&#x8FFD;&#x52A0;&#x3055;&#x308C;&#x308B;&#x308F;&#x3051;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;&#x304F;&#x308A;&#x8FD4;&#x3057;
      Inkscape
      &#x3092;&#x547C;&#x3073;&#x51FA;&#x3059;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306E;&#x4F5C;&#x696D;
      (&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3084;&#x5909;&#x63DB;&#x306A;&#x3069;)
      &#x306F;&#x76F4;&#x3061;&#x306B;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x3067;&#x305D;&#x306E;&#x7D50;&#x679C;&#x304C;&#x7D20;&#x65E9;&#x304F;&#x5F97;&#x3089;&#x308C;&#x3001;&#x30E1;&#x30E2;&#x30EA;&#x6D88;&#x8CBB;&#x3082;&#x6291;&#x3048;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;&#x30B7;&#x30A7;&#x30EB;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x3082;&#x5404;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x6B63;&#x3057;&#x304F;&#x8A18;&#x8FF0;&#x3055;&#x308C;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x540D;&#x306E;
      Inkscape
      &#x306E;&#x5165;&#x529B;&#x306E;&#x5FC5;&#x8981;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;
      (&#x4F8B;: &quot;file.svg --export-pdf=file.pdf&quot;)&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--vacuum-defs</b></dt>
  <dd class="It-tag">SVG &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x5185;&#x306E;
      &lt;lt&gt;defs&lt;gt&gt;
      &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x304B;&#x3089;&#x672A;&#x4F7F;&#x7528;&#x306E;&#x30A2;&#x30A4;&#x30C6;&#x30E0;&#x3092;&#x3059;&#x3079;&#x3066;&#x9664;&#x53BB;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x304C;
      --export-plain-svg
      &#x3068;&#x3068;&#x3082;&#x306B;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x3001;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x306E;&#x307F;&#x4F5C;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3060;&#x3051;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x4FEE;&#x6B63;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-z</b>, <b>--without-gui</b></dt>
  <dd class="It-tag">GUI &#x3092;&#x4F7F;&#x7528;&#x305B;&#x305A; (Unix
      &#x3067;&#x306F; X server
      &#x3092;&#x4F7F;&#x7528;&#x3057;&#x307E;&#x305B;&#x3093;)&#x3001;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x304B;&#x3089;&#x306E;&#x307F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x51E6;&#x7406;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;
      -p&#x3001;-e&#x3001;-l&#x3001;&#x304A;&#x3088;&#x3073; --vacuum-defs
      &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x306E;&#x4F7F;&#x7528;&#x3092;&#x60F3;&#x5B9A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--g-fatal-warnings</b></dt>
  <dd class="It-tag">&#x3053;&#x306E;&#x6A19;&#x6E96; GTK
      &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x3001;&#x901A;&#x5E38;&#x554F;&#x984C;&#x306E;&#x306A;&#x3044;&#x3042;&#x3089;&#x3086;&#x308B;&#x8B66;&#x544A;&#x3067;&#x3082;
      Inkscape &#x3092;&#x4E2D;&#x65AD;&#x3057;&#x307E;&#x3059;
      (&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x7528;)&#x3002;</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--usage</b></dt>
  <dd class="It-tag">&#x7C21;&#x5358;&#x306A;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4E00;&#x89A7;&#x3092;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</dd>
</dl>
<h1 class="Sh" title="Sh" id="&#x8A2D;&#x5B9A;"><a class="selflink" href="#&#x8A2D;&#x5B9A;">&#x8A2D;&#x5B9A;</a></h1>
&#x4E3B;&#x305F;&#x308B;&#x69CB;&#x6210;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;
  ~/.config/inkscape/preferences.xml
  &#x306B;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x4E2D;&#x306B;&#x306F;
  Inkscape
  &#x3092;&#x30AB;&#x30B9;&#x30BF;&#x30DE;&#x30A4;&#x30BA;&#x3059;&#x308B;&#x69D8;&#x3005;&#x306A;&#x8A2D;&#x5B9A;&#x60C5;&#x5831;
  (&#x305D;&#x306E;&#x307B;&#x3068;&#x3093;&#x3069;&#x306F; Inkscape
  &#x306E;&#x8A2D;&#x5B9A;&#x30C0;&#x30A4;&#x30A2;&#x30ED;&#x30B0;&#x306B;&#x3042;&#x308A;&#x307E;&#x3059;)
  &#x304C;&#x3042;&#x308A;&#x3001;&#x305D;&#x306E;&#x30B5;&#x30D6;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x306B;&#x306F;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x30AB;&#x30B9;&#x30BF;&#x30E0;&#x60C5;&#x5831;&#x3092;&#x683C;&#x7D0D;&#x3067;&#x304D;&#x307E;&#x3059;:
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/inkscape/extensions/ -
  &#x30A8;&#x30AF;&#x30B9;&#x30C6;&#x30F3;&#x30B7;&#x30E7;&#x30F3;
  &#x30A8;&#x30D5;&#x30A7;&#x30AF;&#x30C8;
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/inkscape/icons/ -
  &#x30A2;&#x30A4;&#x30B3;&#x30F3;
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/inkscape/keys/ -
  &#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x30DE;&#x30C3;&#x30D7;
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/inkscape/templates/ -
  &#x65B0;&#x898F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30C6;&#x30F3;&#x30D7;&#x30EC;&#x30FC;&#x30C8;
<h1 class="Sh" title="Sh" id="&#x8FD4;&#x308A;&#x5024;"><a class="selflink" href="#&#x8FD4;&#x308A;&#x5024;">&#x8FD4;&#x308A;&#x5024;</a></h1>
&#x3053;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x6B63;&#x5E38;&#x306B;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3068;&#x30BC;&#x30ED;&#x3092;&#x8FD4;&#x3057;&#x3001;&#x7570;&#x5E38;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3068;&#x975E;&#x30BC;&#x30ED;&#x3092;&#x8FD4;&#x3057;&#x307E;&#x3059;&#x3002;
<div class="Pp"></div>
&#x69D8;&#x3005;&#x306A;&#x30A8;&#x30E9;&#x30FC;&#x3042;&#x308B;&#x3044;&#x306F;&#x8B66;&#x544A;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x304C;
  STDERR &#x307E;&#x305F;&#x306F; STDOUT
  &#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x304C;&#x7279;&#x5B9A;&#x306E;
  SVG
  &#x306B;&#x304A;&#x3044;&#x3066;&#x4E0D;&#x898F;&#x5247;&#x306A;&#x6319;&#x52D5;&#x3092;&#x793A;&#x3059;&#x5834;&#x5408;&#x306F;&#x3001;&#x3053;&#x306E;&#x51FA;&#x529B;&#x3092;&#x53C2;&#x7167;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x554F;&#x984C;&#x89E3;&#x6C7A;&#x306B;&#x5F79;&#x7ACB;&#x3061;&#x307E;&#x3059;&#x3002;
<h1 class="Sh" title="Sh" id="&#x4F8B;"><a class="selflink" href="#&#x4F8B;">&#x4F8B;</a></h1>
<b>Inkscape</b> &#x306F; GUI
  &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x3057;&#x3066;&#x958B;&#x767A;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;
  SVG
  &#x3092;&#x51E6;&#x7406;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x3082;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
<div class="Pp"></div>
GUI &#x3067; SVG &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg
</pre>
<div class="Pp"></div>
SVG
  &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x304B;&#x3089;&#x5370;&#x5237;&#x3059;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg -p '| lpr'
</pre>
<div class="Pp"></div>
SVG
  &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x89E3;&#x50CF;&#x5EA6;&#x3067;&#x3042;&#x308B;
  90dpi &#x3067; PNG
  &#x306B;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B; (1
  SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D;&#x306F; 1
  &#x30D3;&#x30C3;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x30D4;&#x30AF;&#x30BB;&#x30EB;&#x306B;&#x5909;&#x63DB;&#x3055;&#x308C;&#x307E;&#x3059;):
<div class="Pp"></div>
<pre>
    inkscape filename.svg --export-png=filename.png
</pre>
<div class="Pp"></div>
&#x540C;&#x69D8;&#x306E;&#x51E6;&#x7406;&#x3067;&#x51FA;&#x529B;&#x30B5;&#x30A4;&#x30BA;&#x3092;
  600x400 &#x30D4;&#x30AF;&#x30BB;&#x30EB;&#x306B;&#x3059;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg --export-png=filename.png -w600 -h400
</pre>
<div class="Pp"></div>
&#x540C;&#x69D8;&#x306E;&#x51E6;&#x7406;&#x3067;&#x3001;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x306A;&#x304F;&#x63CF;&#x753B;&#x5168;&#x4F53;
  (&#x3059;&#x3079;&#x3066;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x5883;&#x754C;&#x67A0;)
  &#x3092;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg --export-png=filename.png --export-area-drawing
</pre>
<div class="Pp"></div>
&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8; &quot;text1555&quot; &#x3092;
  PNG
  &#x306B;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3002;&#x51FA;&#x529B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x304A;&#x3088;&#x3073;&#x89E3;&#x50CF;&#x5EA6;&#x306F;&#x3001;&#x305D;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304C;&#x6700;&#x5F8C;&#x306B;
  GUI
  &#x304B;&#x3089;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x305F;&#x6642;&#x306E;&#x6307;&#x5B9A;&#x3092;&#x5229;&#x7528;&#x3059;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg --export-id=text1555 --export-use-hints
</pre>
<div class="Pp"></div>
&#x540C;&#x69D8;&#x306E;&#x51E6;&#x7406;&#x3092;&#x3001;&#x89E3;&#x50CF;&#x5EA6;&#x306F;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;
  90dpi&#x3001;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3092;&#x6307;&#x5B9A;&#x3001;&#x304A;&#x3088;&#x3073;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x9818;&#x57DF;&#x3092;&#x62E1;&#x5927;&#x65B9;&#x5411;&#x306B;&#x6700;&#x3082;&#x8FD1;&#x3044;
  SVG &#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5358;&#x4F4D; (px)
  &#x5024;&#x306B;&#x30B9;&#x30CA;&#x30C3;&#x30D7;&#x3057;&#x3066;&#x884C;&#x3046;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg --export-id=text1555 --export-png=text.png --export-area-snap
</pre>
<div class="Pp"></div>
Inkscape SVG
  &#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x30D7;&#x30EC;&#x30FC;&#x30F3;
  SVG &#x3078;&#x5909;&#x63DB;&#x3059;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename1.svg --export-plain-svg=filename2.svg
</pre>
<div class="Pp"></div>
SVG &#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092; EPS
  &#x3078;&#x5909;&#x63DB;&#x3059;&#x308B;&#x3002;&#x3059;&#x3079;&#x3066;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306F;&#x30D1;&#x30B9;&#x3078;&#x5909;&#x63DB;&#x3059;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg --export-eps=filename.eps --export-text-to-path
</pre>
<div class="Pp"></div>
&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;ID &quot;text1555&quot;
  &#x306E;&#x5E45;&#x3092;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg --query-width --query-id text1555
</pre>
<div class="Pp"></div>
&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8; ID &quot;text1555&quot;
  &#x306E;&#x8907;&#x88FD;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3001;&#x305D;&#x306E;&#x8907;&#x88FD;&#x3092;
  90&#x00B0;&#x56DE;&#x8EE2;&#x3057;&#x3001;SVG
  &#x306B;&#x4FDD;&#x5B58;&#x3057;&#x3066;&#x7D42;&#x4E86;&#x3059;&#x308B;:
<div class="Pp"></div>
<pre>
    inkscape filename.svg --select=path1555 --verb=EditDuplicate --verb=ObjectRotate90 --verb=FileSave --verb=FileClose
</pre>
<h1 class="Sh" title="Sh" id="&#x74B0;&#x5883;&#x5909;&#x6570;"><a class="selflink" href="#&#x74B0;&#x5883;&#x5909;&#x6570;">&#x74B0;&#x5883;&#x5909;&#x6570;</a></h1>
<b>DISPLAY</b>
  &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x30DB;&#x30B9;&#x30C8;&#x304A;&#x3088;&#x3073;&#x30C7;&#x30A3;&#x30B9;&#x30D7;&#x30EC;&#x30A4;&#x756A;&#x53F7;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x307E;&#x3059;&#x3002;
<div class="Pp"></div>
<b>TMPDIR</b>
  &#x4E00;&#x6642;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x7528;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x306E;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x30D1;&#x30B9;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x306F;&#x5B58;&#x5728;&#x3057;&#x3066;&#x3044;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;
<div class="Pp"></div>
<b>INKSCAPE_PROFILE_DIR</b> to set the path of the directory to use for the user
  profile.
<h1 class="Sh" title="Sh" id="&#x30C6;&#x30FC;&#x30DE;"><a class="selflink" href="#&#x30C6;&#x30FC;&#x30DE;">&#x30C6;&#x30FC;&#x30DE;</a></h1>
&#x8AAD;&#x307F;&#x8FBC;&#x3080;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x30BB;&#x30C3;&#x30C8;&#x306F;
  <b></b><b>$HOME</b><b></b>/.config/inkscape/icons/
  &#x914D;&#x4E0B;&#x304B;&#x3089;&#x53C2;&#x7167;&#x3055;&#x308C;&#x3001;&#x5B58;&#x5728;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;
  <b></b><b>$PREFIX</b><b></b>/share/inkscape/icons/icons.svg
  &#x304C;&#x8AAD;&#x307F;&#x8FBC;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x306F;&#x305D;&#x306E;&#x540D;&#x524D;&#x3067;&#x8AAD;&#x307F;&#x8FBC;&#x307E;&#x308C;
  (&#x4F8B;:
  <i>fill_none.svg</i>)&#x3001;&#x898B;&#x3064;&#x304B;&#x3089;&#x306A;&#x3044;&#x3068;&#x304D;&#x306B;
  <i>icons.svg</i>
  &#x304B;&#x3089;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3069;&#x306E;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3082;&#x3069;&#x3061;&#x3089;&#x306E;&#x5834;&#x6240;&#x304B;&#x3089;&#x3082;&#x898B;&#x3064;&#x304B;&#x3089;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x5834;&#x6240;&#x306B;&#x30D5;&#x30A9;&#x30FC;&#x30EB;&#x30D0;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;
<div class="Pp"></div>
&#x5FC5;&#x8981;&#x306A;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x306F; SVG
  &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304B;&#x3089; SVG ID
  &#x304C;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x540D;&#x3068;&#x30DE;&#x30C3;&#x30C1;&#x3059;&#x308B;&#x3082;&#x306E;&#x304C;&#x8AAD;&#x307F;&#x8FBC;&#x307E;&#x308C;&#x307E;&#x3059;
  (&#x4F8B;&#x3048;&#x3070; &quot;fill_none&quot;
  &#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304B;&#x3089;&#x8AAD;&#x307F;&#x8FBC;&#x3080;&#x3068;&#x304D;&#x306F;&#x3001;
  <i>fill_none.svg</i>
  &#x304B;&#x3001;&#x305D;&#x308C;&#x304C;&#x306A;&#x3051;&#x308C;&#x3070;
  <i>icons.svg</i> &#x304B;&#x3089; SVG ID &quot;fill_none&quot;
  &#x306E;&#x5883;&#x754C;&#x67A0;&#x304C;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3068;&#x3057;&#x3066;&#x63CF;&#x753B;&#x3055;&#x308C;&#x307E;&#x3059;)&#x3002;
<h1 class="Sh" title="Sh" id="&#x305D;&#x306E;&#x4ED6;"><a class="selflink" href="#&#x305D;&#x306E;&#x4ED6;">&#x305D;&#x306E;&#x4ED6;</a></h1>
<b>Inkscape</b>
  &#x306B;&#x95A2;&#x3059;&#x308B;&#x516C;&#x5F0F;&#x306E;&#x60C5;&#x5831;&#x306F;
  http://www.inkscape.org/
  &#x306B;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30A6;&#x30A7;&#x30D6;&#x30B5;&#x30A4;&#x30C8;&#x306B;&#x306F;&#x3001;&#x30CB;&#x30E5;&#x30FC;&#x30B9;&#x3001;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3001;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3001;&#x4F5C;&#x4F8B;&#x3001;&#x30E1;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x30EA;&#x30B9;&#x30C8;&#x66F8;&#x5EAB;&#x3001;&#x6700;&#x65B0;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3001;&#x30D0;&#x30B0;&#x304A;&#x3088;&#x3073;&#x6A5F;&#x80FD;&#x8981;&#x671B;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x30D9;&#x30FC;&#x30B9;&#x3001;&#x30D5;&#x30A9;&#x30FC;&#x30E9;&#x30E0;&#x306A;&#x3069;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;
<h1 class="Sh" title="Sh" id="&#x95A2;&#x9023;&#x9805;&#x76EE;"><a class="selflink" href="#&#x95A2;&#x9023;&#x9805;&#x76EE;">&#x95A2;&#x9023;&#x9805;&#x76EE;</a></h1>
potrace, cairo, <i>rsvg</i>(1), batik, ghostscript, pstoedit.
<div class="Pp"></div>
SVG &#x6E96;&#x62E0;&#x30C6;&#x30B9;&#x30C8;&#x30B9;&#x30A4;&#x30FC;&#x30C8;:
  http://www.w3.org/Graphics/SVG/Test/
<div class="Pp"></div>
SVG &#x691C;&#x8A3C;: http://jiggles.w3.org/svgvalidator/
<div class="Pp"></div>
<i>Scalable Vector Graphics (SVG) 1.1 Specification</i> <i>W3C Recommendation
  14</i> <i>January 2003</i> &lt;http://www.w3.org/TR/SVG11/&gt;
<div class="Pp"></div>
<i>Scalable Vector Graphics (SVG) 1.2 Specification</i> <i>W3C Working Draft
  13</i> <i>November 2003</i> &lt;http://www.w3.org/TR/SVG12/&gt;
<div class="Pp"></div>
<i>SVG 1.1/1.2/2.0 Requirements</i> <i>W3C Working Draft 22 April 2002</i>
  &lt;http://www.w3.org/TR/SVG2Reqs/&gt;
<div class="Pp"></div>
<i>Document Object Model (DOM): Level 2 Core</i> <i>Arnaud Le Hors et al
  editors,</i> <i>W3C</i> &lt;http://www.w3.org/TR/DOM-Level-2-Core/&gt;
<h1 class="Sh" title="Sh" id="GUI_&#x60C5;&#x5831;"><a class="selflink" href="#GUI_&#x60C5;&#x5831;">GUI
  &#x60C5;&#x5831;</a></h1>
Inkscape &#x306E; GUI
  &#x64CD;&#x4F5C;&#x306B;&#x3064;&#x3044;&#x3066;&#x5B66;&#x3076;&#x306B;&#x306F;&#x3001;&#x300C;&#x30D8;&#x30EB;&#x30D7;&#x300D;&gt;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x300D;&#x914D;&#x4E0B;&#x306B;&#x3042;&#x308B;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x53C2;&#x7167;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;
<div class="Pp"></div>
Inkscape &#x306F; SVG
  &#x4EE5;&#x5916;&#x306B;&#x3082;&#x3001;&#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x30D3;&#x30C3;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x5F62;&#x5F0F;
  (PNG&#x3001;BMP&#x3001;JPG&#x3001;XPM&#x3001;GIF
  &#x306A;&#x3069;)&#x3001;&#x30D7;&#x30EC;&#x30FC;&#x30F3;&#x30C6;&#x30AD;&#x30B9;&#x30C8;
  (Perl &#x304C;&#x5FC5;&#x8981;)&#x3001;PS &#x304A;&#x3088;&#x3073; EPS
  (Ghostscript &#x304C;&#x5FC5;&#x8981;)&#x3001;PDF &#x304A;&#x3088;&#x3073; AI
  &#x5F62;&#x5F0F; (AI &#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3; 9.0
  &#x4EE5;&#x964D;)
  &#x3092;&#x30A4;&#x30F3;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x304D;&#x307E;&#x3059;
  (&#x300C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x300D;&gt;&#x300C;&#x30A4;&#x30F3;&#x30DD;&#x30FC;&#x30C8;&#x300D;)&#x3002;
<div class="Pp"></div>
Inkscape exports 32-bit PNG images (File &gt; Export PNG Image) as well as AI,
  PS, EPS, PDF, DXF, and several other formats via File &gt; Save as.
<div class="Pp"></div>
Inkscape
  &#x306F;&#x30B0;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x30BF;&#x30D6;&#x30EC;&#x30C3;&#x30C8;&#x306E;&#x7B46;&#x5727;&#x304A;&#x3088;&#x3073;&#x50BE;&#x304D;&#x691C;&#x51FA;&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;&#x30AB;&#x30EA;&#x30B0;&#x30E9;&#x30D5;&#x30A3;&#x30C4;&#x30FC;&#x30EB;&#x306A;&#x3069;&#x3067;&#x30DA;&#x30F3;&#x306E;&#x5E45;&#x3001;&#x89D2;&#x5EA6;&#x3001;&#x304A;&#x3088;&#x3073;&#x52D5;&#x304D;&#x306B;&#x5229;&#x7528;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
<div class="Pp"></div>
Inkscape
  &#x306F;&#x30D3;&#x30C3;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x30A8;&#x30F3;&#x30B8;&#x30F3;
  Potrace (http://potrace.sf.net) &#x306E; GUI
  &#x30D5;&#x30ED;&#x30F3;&#x30C8;&#x30A8;&#x30F3;&#x30C9;&#x3092;&#x5177;&#x5099;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
<div class="Pp"></div>
Inkscape &#x306F;&#x5916;&#x90E8;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;
  (&#x6A19;&#x6E96;&#x5165;&#x529B;&#x304B;&#x3089;&#x6A19;&#x6E96;&#x51FA;&#x529B;&#x3078;&#x306E;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30FC;)
  &#x3092;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x3001;&#x305D;&#x308C;&#x3089;&#x306F;&#x300C;&#x30A8;&#x30AF;&#x30B9;&#x30C6;&#x30F3;&#x30B7;&#x30E7;&#x30F3;&#x300D;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306F;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x30FC;&#x8A2D;&#x5B9A;&#x306E;&#x305F;&#x3081;&#x306E;
  GUI
  &#x30C0;&#x30A4;&#x30A2;&#x30ED;&#x30B0;&#x3092;&#x6301;&#x3064;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x901A;&#x3057;&#x3066;&#x4F5C;&#x7528;&#x3059;&#x308B;&#x9078;&#x629E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;
  ID
  &#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;Inkscape
  &#x306F; Python
  &#x3067;&#x66F8;&#x304B;&#x308C;&#x305F;&#x30A8;&#x30D5;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x5404;&#x7A2E;&#x53D6;&#x308A;&#x63C3;&#x3048;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
<h1 class="Sh" title="Sh" id="&#x30AD;&#x30FC;&#x30D0;&#x30A4;&#x30F3;&#x30C9;"><a class="selflink" href="#&#x30AD;&#x30FC;&#x30D0;&#x30A4;&#x30F3;&#x30C9;">&#x30AD;&#x30FC;&#x30D0;&#x30A4;&#x30F3;&#x30C9;</a></h1>
&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3068;&#x30DE;&#x30A6;&#x30B9;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x306E;&#x5B8C;&#x5168;&#x306A;&#x30EA;&#x30B9;&#x30C8;&#x306F;&#x3001;doc/keys.html
  &#x304B;&#x300C;&#x30D8;&#x30EB;&#x30D7;&#x300D;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306E;&#x300C;&#x30AD;&#x30FC;&#x3068;&#x30DE;&#x30A6;&#x30B9;&#x306E;&#x30EA;&#x30D5;&#x30A1;&#x30EC;&#x30F3;&#x30B9;&#x300D;&#x304B;&#x3089;&#x53C2;&#x7167;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
<h1 class="Sh" title="Sh" id="&#x30D0;&#x30B0;"><a class="selflink" href="#&#x30D0;&#x30B0;">&#x30D0;&#x30B0;</a></h1>
&#x591A;&#x304F;&#x306E;&#x30D0;&#x30B0;&#x304C;&#x5831;&#x544A;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x30A6;&#x30A7;&#x30D6;&#x30B5;&#x30A4;&#x30C8;
  (inkscape.org)
  &#x304B;&#x3089;&#x5831;&#x544A;&#x3055;&#x308C;&#x305F;&#x3082;&#x306E;&#x3092;&#x53C2;&#x7167;&#x3057;&#x3001;&#x65B0;&#x3057;&#x304F;&#x767A;&#x898B;&#x3057;&#x305F;&#x554F;&#x984C;&#x3092;&#x5831;&#x544A;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#x304A;&#x4F7F;&#x3044;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x306E;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x30CE;&#x30FC;&#x30C8;&#x5185;&#x306E;
  Known Issues (&#x65E2;&#x77E5;&#x306E;&#x554F;&#x984C;)
  &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3082;&#x53C2;&#x7167;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;
<h1 class="Sh" title="Sh" id="&#x8457;&#x8005;"><a class="selflink" href="#&#x8457;&#x8005;">&#x8457;&#x8005;</a></h1>
&#x3053;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x30D9;&#x30FC;&#x30B9;&#x306F;&#x3001;&#x69D8;&#x3005;&#x306A;&#x5F62;&#x306E;&#x8CA2;&#x732E;&#x306B;&#x3088;&#x3063;&#x3066;&#x6210;&#x308A;&#x7ACB;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x4EE5;&#x4E0B;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x304C;&#x5B8C;&#x5168;&#x3067;&#x306A;&#x3044;&#x3053;&#x3068;&#x306F;&#x78BA;&#x304B;&#x306A;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x3053;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x591A;&#x304F;&#x306E;&#x65B9;&#x3005;&#x306B;&#x5354;&#x529B;&#x3057;&#x3066;&#x3044;&#x305F;&#x3060;&#x3044;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x77E5;&#x308B;&#x306E;&#x306B;&#x5F79;&#x7ACB;&#x3061;&#x307E;&#x3059;&#x3002;
<div class="Pp"></div>
Maximilian Albert, Joshua A. Andler, Tavmjong Bah, Pierre Barbry-Blot,
  Jean-Fran&#x00E7;ois Barraud, Campbell Barton, Bill Baxter, John Beard, John
  Bintz, Arpad Biro, Nicholas Bishop, Joshua L. Blocher, Hanno B&#x00F6;ck,
  Tomasz Boczkowski, Henrik Bohre, Boldewyn, Daniel Borgmann, Bastien Bouclet,
  Hans Breuer, Gustav Broberg, Christopher Brown, Marcus Brubaker, Luca Bruno,
  Nicu Buculei, Bulia Byak, Pierre Caclin, Ian Caldwell, Gail Carmichael, Ed
  Catmur, Chema Celorio, Jabiertxo Arraiza Cenoz, Johan Ceuppens, Zbigniew
  Chyla, Alexander Clausen, John Cliff, Kees Cook, Ben Cromwell, Robert Crosbie,
  Jon Cruz, Aur&#x00E9;lie De-Cooman, Kris De Gussem, Milosz Derezynski, Daniel
  D&#x00ED;az, Bruno Dilly, Larry Doolittle, Nicolas Dufour, Tim Dwyer, Maxim V.
  Dziumanenko, Johan Engelen, Miklos Erdelyi, Ulf Erikson, No&#x00E9; Falzon,
  Frank Felfe, Andrew Fitzsimon, Edward Flick, Marcin Floryan, Fred, Ben Fowler,
  Cedric Gemy, Steren Giannini, Olivier Gondouin, Ted Gould, Toine de Greef,
  Michael Grosberg, Bryce Harrington, Dale Harvey, Aur&#x00E9;lio Adnauer
  Heckert, Carl Hetherington, Jos Hirth, Hannes Hochreiner, Thomas Holder, Joel
  Holdsworth, Christoffer Holmstedt, Alan Horkan, Karl Ove Hufthammer, Richard
  Hughes, Nathan Hurst, inductiveload, Thomas Ingham, Jean-Olivier Irisson, Bob
  Jamison, Ted Janeczko, jEsuSdA, Lauris Kaplinski, Lynn Kerby, Niko Kiirala,
  James Kilfiger, Nikita Kitaev, Jason Kivlighn, Adrian Knoth, Krzysztof
  Kosi&#x0144;ski, Petr Kovar, Beno&#x00EE;t Lavorata, Alex Leone, Julien Leray,
  Raph Levien, Diederik van Lierop, Nicklas Lindgren, Vitaly Lipatov, Ivan
  Louette, Fernando Lucchesi Bastos Jurema, Pierre-Antoine Marc,
  Aurel-Aim&#x00E9; Marmion, Colin Marquardt, Craig Marshall, Ivan Mas&#x00E1;r,
  Dmitry G. Mastrukov, David Mathog, Matiphas, Michael Meeks, Federico Mena,
  MenTaLguY, Aubanel Monnier, Vincent Montagne, Tim Mooney, Derek P. Moore,
  Chris Morgan, Peter Moulder, J&#x00F6;rg M&#x00FC;ller, Yukihiro Nakai, Victor
  Navez, Christian Neumair, Nick, Andreas Nilsson, Mitsuru Oka, Vin&#x00ED;cius
  dos Santos Oliveira, Martin Owens, Alvin Penner, Matthew Petroff, Jon
  Phillips, Zdenko Podobny, Alexandre Prokoudine, Jean-Ren&#x00E9; Reinhard,
  Alexey Remizov, Frederic Rodrigo, Hugo Rodrigues, Juarez Rudsatz, Xavier Conde
  Rueda, Felipe Corr&#x00EA;a da Silva Sanches, Christian Schaller, Marco
  Scholten, Tom von Schwerdtner, Danilo &#x0160;egan, Abhishek Sharma, Shivaken,
  Michael Sloan, John Smith, Bo&#x0161;tjan &#x0160;peti&#x010D;, Aaron Spike,
  Kaushik Sridharan, Ralf Stephan, Dariusz Stojek, Martin Sucha, ~suv, Pat
  Suwalski, Adib Taraben, Hugh Tebby, Jonas Termeau, David Turner, Andre
  Twupack, Aleksandar Uro&#x0161;evi&#x0107;, Alex Valavanis, Joakim Verona,
  Lucas Vieites, Daniel Wagenaar, Liam P. White, Sebastian W&#x00FC;st, Michael
  Wybrow, Gellule Xg, Daniel Yacob, David Yip, Masatake Yamato
<div class="Pp"></div>
This man page was put together by Bryce Harrington
  &lt;brycehar@bryceharrington.org&gt;.
<h1 class="Sh" title="Sh" id="&#x6CBF;&#x9769;"><a class="selflink" href="#&#x6CBF;&#x9769;">&#x6CBF;&#x9769;</a></h1>
&#x5F8C;&#x306B; Inkscape
  &#x3068;&#x306A;&#x308B;&#x30B3;&#x30FC;&#x30C9;&#x30D9;&#x30FC;&#x30B9;&#x306F;
  1999 &#x5E74;&#x3001;GNOME
  &#x30A4;&#x30E9;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30BF;&#x30FC;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;
  Gill &#x3068;&#x3057;&#x3066; Raph Leiven
  &#x306B;&#x3088;&#x3063;&#x3066;&#x88FD;&#x4F5C;&#x304C;&#x958B;&#x59CB;&#x3055;&#x308C;&#x307E;&#x3057;&#x305F;&#x3002;Gill
  &#x306E;&#x5F53;&#x521D;&#x306E;&#x76EE;&#x6A19;&#x306F;&#x6700;&#x7D42;&#x7684;&#x306B;
  SVG
  &#x306E;&#x3059;&#x3079;&#x3066;&#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3057;&#x305F;&#x3002;Raph
  &#x306F;&#x3001;&#x30B9;&#x30C8;&#x30ED;&#x30FC;&#x30AF;&#x3068;&#x30D5;&#x30A3;&#x30EB;&#x3001;&#x7DDA;&#x306E;&#x30AD;&#x30E3;&#x30C3;&#x30D7;&#x65B9;&#x5F0F;&#x3001;&#x7DDA;&#x306E;&#x9023;&#x7D50;&#x65B9;&#x5F0F;&#x3001;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306A;&#x3069;&#x3092;&#x542B;&#x3080;
  PostScript
  &#x30D9;&#x30B8;&#x30A8;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x30F3;&#x30B0;&#x30E2;&#x30C7;&#x30EB;&#x3092;&#x5B9F;&#x88C5;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;Raph
  &#x306E; Gill &#x306E;&#x30A6;&#x30A7;&#x30D6;&#x30DA;&#x30FC;&#x30B8;&#x306F;
  http://www.levien.com/svg/ &#x3067;&#x3059;&#x3002;Gill
  &#x306E;&#x958B;&#x767A;&#x306F; 2000
  &#x5E74;&#x306B;&#x306F;&#x505C;&#x6EDE;&#x3057;&#x305F;&#x304B;&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;&#x505C;&#x6B62;&#x3057;&#x305F;&#x3088;&#x3046;&#x3067;&#x3059;&#x3002;
<div class="Pp"></div>
&#x6B21;&#x306B;&#x3053;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x30D9;&#x30FC;&#x30B9;&#x306F;
  Lauris Kaplinski
  &#x304C;&#x4E2D;&#x5FC3;&#x3068;&#x306A;&#x3063;&#x3066;&#x975E;&#x5E38;&#x306B;&#x4EBA;&#x6C17;&#x306E;&#x3042;&#x308B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;
  Sodipodi
  &#x306B;&#x5F15;&#x304D;&#x7D99;&#x304C;&#x308C;&#x307E;&#x3057;&#x305F;&#x3002;&#x30B3;&#x30FC;&#x30C9;&#x30D9;&#x30FC;&#x30B9;&#x306F;&#x6570;&#x5E74;&#x306E;&#x4F5C;&#x696D;&#x3092;&#x7D4C;&#x3066;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x65B0;&#x6A5F;&#x80FD;&#x306E;&#x8FFD;&#x52A0;&#x3001;&#x591A;&#x8A00;&#x8A9E;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3001;Windows
  &#x305D;&#x306E;&#x4ED6;&#x306E; OS
  &#x3078;&#x306E;&#x79FB;&#x690D;&#x3001;&#x304A;&#x3088;&#x3073;&#x4F9D;&#x5B58;&#x95A2;&#x4FC2;&#x306E;&#x6574;&#x7406;&#x304C;&#x884C;&#x308F;&#x308C;&#x3001;&#x5F37;&#x529B;&#x306A;&#x30A4;&#x30E9;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306B;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;
<div class="Pp"></div>
2003 &#x5E74;&#x3001;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306A; Sodopodi
  &#x958B;&#x767A;&#x8005;&#x3067;&#x3042;&#x3063;&#x305F; Bryce
  Harrington&#x3001;MenTaLguY&#x3001;Nathan
  Hurst&#x3001;&#x304A;&#x3088;&#x3073; Ted Gould &#x306E; 4
  &#x4EBA;&#x306F;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x304A;&#x3051;&#x308B;
  SVG
  &#x6E96;&#x62E0;&#x3084;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30D5;&#x30A7;&#x30A4;&#x30B9;&#x306E;&#x30EB;&#x30C3;&#x30AF;&#x30A2;&#x30F3;&#x30C9;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x306B;&#x95A2;&#x3057;&#x3066;&#x306E;&#x7570;&#x306A;&#x308B;&#x65B9;&#x5411;&#x3001;&#x304A;&#x3088;&#x3073;&#x53C2;&#x52A0;&#x8005;&#x306B;&#x958B;&#x304B;&#x308C;&#x305F;&#x958B;&#x767A;&#x4F53;&#x5236;&#x3092;&#x3068;&#x308B;&#x3053;&#x3068;&#x3092;&#x76EE;&#x7684;&#x3068;&#x3057;&#x3066;
  Inkscape
  &#x3092;&#x7ACB;&#x3061;&#x4E0A;&#x3052;&#x307E;&#x3057;&#x305F;&#x3002;
<div class="Pp"></div>
&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x521D;&#x671F;&#x306B;&#x306F;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x306E;&#x5B89;&#x5B9A;&#x5316;&#x3068;&#x56FD;&#x969B;&#x5316;&#x306B;&#x7126;&#x70B9;&#x304C;&#x304A;&#x304B;&#x308C;&#x591A;&#x304F;&#x306E;&#x4F5C;&#x696D;&#x304C;&#x884C;&#x308F;&#x308C;&#x307E;&#x3057;&#x305F;&#x3002;Sodipodi
  &#x304B;&#x3089;&#x53D7;&#x3051;&#x7D99;&#x304C;&#x308C;&#x305F;&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x30EC;&#x30F3;&#x30C0;&#x30E9;&#x30FC;&#x306B;&#x306F;&#x3001;&#x6570;&#x5B66;&#x7684;&#x306B;&#x307E;&#x308C;&#x3067;&#x3059;&#x304C;&#x6240;&#x5B9A;&#x306E;&#x64CD;&#x4F5C;&#x304B;&#x3089;&#x5916;&#x308C;&#x305F;&#x3068;&#x304D;&#x306B;&#x60F3;&#x5B9A;&#x5916;&#x306E;&#x30AF;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3092;&#x5F15;&#x304D;&#x8D77;&#x3053;&#x3059;&#x6570;&#x591A;&#x304F;&#x306E;&#x30B1;&#x30FC;&#x30B9;&#x304C;&#x5B58;&#x5728;&#x3057;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x3053;&#x306E;&#x30EC;&#x30F3;&#x30C0;&#x30E9;&#x30FC;&#x306F;&#x5B8C;&#x5168;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x304C;&#x683C;&#x6BB5;&#x306B;&#x5B89;&#x5B9A;&#x6027;&#x306B;&#x512A;&#x308C;&#x305F;
  Livarot
  &#x306B;&#x7F6E;&#x304D;&#x63DB;&#x3048;&#x3089;&#x308C;&#x307E;&#x3057;&#x305F;&#x3002;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306F;&#x307E;&#x305F;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x983B;&#x7E41;&#x306B;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3057;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x958B;&#x767A;&#x4E2D;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x30B9;&#x30CA;&#x30C3;&#x30D7;&#x30B7;&#x30E7;&#x30C3;&#x30C8;&#x3092;&#x5229;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x5968;&#x52B1;&#x3059;&#x308B;&#x65B9;&#x91DD;&#x3092;&#x63A1;&#x7528;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x3053;&#x308C;&#x306F;&#x30D0;&#x30B0;&#x3092;&#x901F;&#x3084;&#x304B;&#x306B;&#x767A;&#x898B;&#x3057;&#x3001;&#x4FEE;&#x6B63;&#x306E;&#x78BA;&#x8A8D;&#x3092;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x7C21;&#x5358;&#x306B;&#x884C;&#x3048;&#x308B;&#x3053;&#x3068;&#x306B;&#x7E4B;&#x304C;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x7D50;&#x679C;&#x3001;Inkscape
  &#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x306F;&#x4E00;&#x822C;&#x306B;&#x5805;&#x7262;&#x3067;&#x4FE1;&#x983C;&#x6027;&#x304C;&#x3042;&#x308B;&#x3068;&#x3044;&#x3046;&#x8A55;&#x4FA1;&#x3092;&#x5F97;&#x307E;&#x3057;&#x305F;&#x3002;
<div class="Pp"></div>
&#x540C;&#x69D8;&#x306B;&#x3001;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30D5;&#x30A7;&#x30A4;&#x30B9;&#x306E;&#x56FD;&#x969B;&#x5316;&#x3068;&#x30ED;&#x30FC;&#x30AB;&#x30E9;&#x30A4;&#x30BA;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x3082;&#x884C;&#x308F;&#x308C;&#x3001;&#x4E16;&#x754C;&#x4E2D;&#x304B;&#x3089;&#x306E;&#x8CA2;&#x732E;&#x3092;&#x5F97;&#x308B;&#x3053;&#x3068;&#x306B;&#x5F79;&#x7ACB;&#x3061;&#x307E;&#x3057;&#x305F;&#x3002;
<div class="Pp"></div>
Inkscape
  &#x306F;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3001;&#x30B9;&#x30D7;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30F3;&#x3001;&#x30A6;&#x30A7;&#x30D6;&#x30B5;&#x30A4;&#x30C8;&#x30A2;&#x30FC;&#x30C8;&#x306A;&#x3069;&#x3092;&#x4F5C;&#x6210;&#x3084;&#x5171;&#x6709;&#x3059;&#x308B;&#x30C4;&#x30FC;&#x30EB;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;&#x5168;&#x4F53;&#x306E;&#x8996;&#x899A;&#x7684;&#x306A;&#x9B45;&#x529B;&#x306B;&#x6709;&#x76CA;&#x306A;&#x5F71;&#x97FF;&#x3092;&#x53CA;&#x307C;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x3042;&#x308B;&#x610F;&#x5473;&#x300C;&#x305F;&#x3060;&#x306E;&#x30C9;&#x30ED;&#x30FC;&#x30A4;&#x30F3;&#x30B0;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x300D;&#x3067;&#x3042;&#x308B;&#x306B;&#x3082;&#x304B;&#x304B;&#x308F;&#x3089;&#x305A;&#x3001;Inkscape
  &#x306F;&#x3001;&#x3088;&#x308A;&#x591A;&#x304F;&#x306E;&#x4EBA;&#x3005;&#x306B;&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x8996;&#x899A;&#x7684;&#x523A;&#x6FC0;&#x3092;&#x4E0E;&#x3048;&#x308B;&#x91CD;&#x8981;&#x306A;&#x5F79;&#x5272;&#x3092;&#x62C5;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
<h1 class="Sh" title="Sh" id="&#x8457;&#x4F5C;&#x6A29;&#x304A;&#x3088;&#x3073;&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;"><a class="selflink" href="#&#x8457;&#x4F5C;&#x6A29;&#x304A;&#x3088;&#x3073;&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;">&#x8457;&#x4F5C;&#x6A29;&#x304A;&#x3088;&#x3073;&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;</a></h1>
<b>Copyright (C)</b> 1999&#x2013;2010 by Authors.
<div class="Pp"></div>
<b>Inkscape</b>
  &#x306F;&#x30D5;&#x30EA;&#x30FC;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3067;&#x3059;&#x3002;&#x3042;&#x306A;&#x305F;&#x306F;
  GPL
  &#x306E;&#x793A;&#x3059;&#x6761;&#x4EF6;&#x4E0B;&#x306B;&#x304A;&#x3044;&#x3066;&#x3053;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x914D;&#x5E03;&#x304A;&#x3088;&#x3073;/&#x307E;&#x305F;&#x306F;&#x5909;&#x66F4;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</div>
<table class="foot">
  <tr>
    <td class="foot-date"></td>
    <td class="foot-os">Inkscape-0.91pre4</td>
  </tr>
</table>
</body>
</html>
