<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8"/>
  <style>
    table.head, table.foot { width: 100%; }
    td.head-rtitle, td.foot-os { text-align: right; }
    td.head-vol { text-align: center; }
    div.Pp { margin: 1ex 0ex; }
  </style>
  <title>INKSCAPE(1)</title>
</head>
<body>
<table class="head">
  <tr>
    <td class="head-ltitle">INKSCAPE(1)</td>
    <td class="head-vol">Inkscape</td>
    <td class="head-rtitle">INKSCAPE(1)</td>
  </tr>
</table>
<div class="manual-text">
<h1 class="Sh" title="Sh" id="NOM"><a class="selflink" href="#NOM">NOM</a></h1>
Inkscape - programme d'&#x00E9;dition SVG (Scalable Vector Graphics).
<h1 class="Sh" title="Sh" id="SYNOPSIS"><a class="selflink" href="#SYNOPSIS">SYNOPSIS</a></h1>
&quot;inkscape [options] [nom_de_fichier ...]&quot;
<div class="Pp"></div>
options:
<div class="Pp"></div>
<pre>
    -?, --help        
        --usage       
    -V, --version
    -f, --file=NOMDEFICHIER               
    -e, --export-png=NOMDEFICHIER         
    -a, --export-area=x0:y0:x1:y1     
    -C, --export-area-page
    -D, --export-area-drawing
        --export-area-snap
    -i, --export-id=ID     
    -j, --export-id-only     
    -t, --export-use-hints
    -b, --export-background=COULEUR     
    -y, --export-background-opacity=VALEUR     
    -d, --export-dpi=DPI              
    -w, --export-width=LARGEUR          
    -h, --export-height=HAUTEUR        
    -P, --export-ps=NOMDEFICHIER
    -E, --export-eps=NOMDEFICHIER
    -A, --export-pdf=NOMDEFICHIER
        --export-pdf-version=NUMERODEVERSION
        --export-latex
    --export-ps-level {2,3}
    -T, --export-text-to-path
        --export-ignore-filters
    -l, --export-plain-svg=NOMDEFICHIER             
    -p, --print=IMPRIMANTE
    -I, --query-id=ID     
    -X, --query-x
    -Y, --query-y
    -W, --query-width
    -H, --query-height
    -S, --query-all
    -x, --extension-directory
        --verb-list
        --verb=VERB-ID
        --select=OBJECT-ID
        --shell
    -g, --with-gui                    
    -z, --without-gui                 
        --vacuum-defs
        --g-fatal-warnings
</pre>
<h1 class="Sh" title="Sh" id="DESCRIPTION"><a class="selflink" href="#DESCRIPTION">DESCRIPTION</a></h1>
<b>Inkscape</b> est un &#x00E9;diteur de dessin au format <b>Scalable Vector
  Graphics</b> <b>(SVG)</b> dot&#x00E9; d'une interface graphique, offrant des
  possibilit&#x00E9;s similaires &#x00E0; <b>Adobe Illustrator</b>,
  <b>CorelDraw</b>, <b>Xara Xtreme</b>, etc. Les fonctionnalit&#x00E9;s
  d'Inkscape comprennent une gestion versatile des formes, le dessin &#x00E0;
  main lev&#x00E9;e et les courbes de B&#x00E9;zier, le texte multiligne, le
  texte suivant un chemin, la transparence, les transformations affines, les
  remplissages par motif ou d&#x00E9;grad&#x00E9;, l'&#x00E9;dition de
  n&#x0153;uds, l'export SVG vers PNG, le groupement, les calques, les clones
  interactifs et bien plus encore. L'interface est con&#x00E7;ue pour
  &#x00EA;tre confortable et efficace pour les utilisateurs
  exp&#x00E9;riment&#x00E9;s tout en restant conforme aux sp&#x00E9;cifications
  de <b>GNOME</b> permettant ainsi aux utilisateurs d'applications GNOME de s'y
  habituer rapidement.
<div class="Pp"></div>
Le format <b>SVG</b> est un format XML standard pour le dessin vectoriel 2D. Il
  permet de d&#x00E9;finir des objets sur un dessin par l'utilisation de points,
  chemins et formes primitives. Les couleurs, fontes, largeur de contour et
  autres sont sp&#x00E9;cifi&#x00E9;s en tant qu'attributs de 'style' de ces
  objets. Le but est de rendre possible l'utilisation de fichiers SVG pour un
  grand nombre de programmes et d'utilisation, SVG &#x00E9;tant un standard et
  ses fichiers du type texte/xml.
<div class="Pp"></div>
<b>Inkscape</b> utilise le SVG comme format natif de ses documents, et a pour
  but de devenir le plus conforme des programmes de dessin SVG, disponible pour
  la communaut&#x00E9; du logiciel libre.
<h1 class="Sh" title="Sh" id="OPTIONS"><a class="selflink" href="#OPTIONS">OPTIONS</a></h1>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-?</b>, <b>--help</b></dt>
  <dd class="It-tag">Affiche un message d'aide.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-V</b>, <b>--version</b></dt>
  <dd class="It-tag">Affiche la version d'Inkscape et la date de
    compilation.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-a</b> <i>x0:y0:x1:y1</i>,
    <b>--export-area</b>=<i>x0:y0:x1:y1</i></dt>
  <dd class="It-tag">Pour l'export en PNG, d&#x00E9;finit la zone &#x00E0;
      exporter en pixels SVG (unit&#x00E9; anonyme de longueur utilis&#x00E9;e
      normalement par le format SVG Inkscape). Le comportement par d&#x00E9;faut
      est d'exporter la page du document. Le point (0,0) est le coin
      inf&#x00E9;rieur gauche.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-C</b>, <b>--export-area-page</b></dt>
  <dd class="It-tag">Pour l'export en PNG, PDF, PS et EPS, la zone
      export&#x00E9;e est la page. C'est habituellement le comportement par
      d&#x00E9;faut pour les formats PNG, PDF et PS, aussi sp&#x00E9;cifier
      cette option n'est pas n&#x00E9;cessaire pour ces formats sauf si l'option
      --export-id est utilis&#x00E9;e pour exporter un objet sp&#x00E9;cifique.
      En EPS, cependant, il ne s'agit pas du comportement par d&#x00E9;faut. De
      plus, pour l'EPS, la sp&#x00E9;cification du format n'autorise pas sa
      bo&#x00EE;te englobante &#x00E0; s'&#x00E9;tendre au-del&#x00E0; de son
      contenu, ce qui signifie que lorsque l'option --export-area-page est
      utilis&#x00E9;e pour l'export EPS, la bo&#x00EE;te englobante de la page
      sera redimensionn&#x00E9;e pour s'adapter &#x00E0; la bo&#x00EE;te
      englobante de son contenu si elle est plus petite.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-D</b>, <b>--export-area-drawing</b></dt>
  <dd class="It-tag">Pour l'export en PNG, PDF, PS et EPS, la zone &#x00E0;
      exporter est le dessin entier (pas la page), c'est &#x00E0; dire la
      bo&#x00EE;te englobante de l'ensemble des objets du document (ou des
      objets export&#x00E9;s lorsque l'option --export-id est utilis&#x00E9;e).
      Avec cette option, l'image export&#x00E9;e n'affichera que les objets
      visibles du document sans marge ni massicotage. Il s'agit de l'option par
      d&#x00E9;faut pour l'export au format EPS. Peut &#x00EA;tre
      combin&#x00E9;, lors de l'export en PNG, avec --export-use-hints.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-area-snap</b></dt>
  <dd class="It-tag">Arrondi les dimensions de la zone &#x00E0; exporter aux
      valeurs enti&#x00E8;res sup&#x00E9;rieures en unit&#x00E9;s SVG
      utilisateur (px). Si vous utilisez une r&#x00E9;solution d'export de 90
      ppp et que vos objets sont align&#x00E9;s aux pixels afin de minimiser
      l'anti-cr&#x00E9;nelage, cette option permet de pr&#x00E9;server cet
      alignement m&#x00EA;me si l'export se fait selon des bo&#x00EE;tes de
      contour (avec --export-id ou --export-area-drawing) qui ne sont pas
      correctement align&#x00E9;es sur les pixels.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-b</b> <i>COULEUR</i>,
    <b>--export-background</b>=<i>COULEUR</i></dt>
  <dd class="It-tag">Couleur de fond du PNG export&#x00E9;. Cette valeur peut
      &#x00EA;tre n'importe quelle cha&#x00EE;ne de couleur support&#x00E9;e par
      le format SVG, par exemple &quot;#ff007f&quot; ou &quot;rgb(255, 0,
      128)&quot;. Si cette couleur n'est pas d&#x00E9;finie, la couleur de page
      d&#x00E9;finie dans Inkscape via la bo&#x00EE;te de dialogue
      Pr&#x00E9;f&#x00E9;rences du document sera utilis&#x00E9;e
      (enregistr&#x00E9;e dans l'attribut pagecolor= de
    sodipodi:namedview).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-d</b> <i>PPP</i>, <b>--export-dpi</b>=<i>PPP</i></dt>
  <dd class="It-tag">La r&#x00E9;solution utilis&#x00E9;e pour l'export en PNG.
      Elle est &#x00E9;galement utilis&#x00E9;e pour d&#x00E9;finir le niveau de
      rast&#x00E9;risation des objets filtr&#x00E9;s lors de l'export en PS, EPS
      ou PDF (sauf si l'option --export-ignore-filters est utilis&#x00E9;e).
      Elle est de 90 par d&#x00E9;faut, correspondant &#x00E0; 1 pixel SVG (px,
      aussi appel&#x00E9; &#x00AB; unit&#x00E9; utilisateur &#x00BB;)
      s'exportant vers 1 pixel bitmap. Cette valeur pr&#x00E9;empte la PPP
      enregistr&#x00E9;e avec le document si la commande est utilis&#x00E9;e
      avec --export-use-hints.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-e</b> <i>NOMDEFICHIER</i>,
    <b>--export-png</b>=<i>NOMDEFICHIER</i></dt>
  <dd class="It-tag">Sp&#x00E9;cifie le nom de fichier pour l'export en PNG.
      S'il existe d&#x00E9;j&#x00E0;, il sera &#x00E9;cras&#x00E9; sans demande
      de confirmation.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-f</b> <i>NOMDEFICHIER</i>,
    <b>--file</b>=<i>NOMDEFICHIER</i></dt>
  <dd class="It-tag">Ouvre le(s) document(s) sp&#x00E9;cifi&#x00E9;(s). La
      cha&#x00EE;ne d'option peut &#x00EA;tre omise, c'est &#x00E0; dire que
      vous pouvez lister les noms de fichier sans -f.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-g</b>, <b>--with-gui</b></dt>
  <dd class="It-tag">Tente d'utiliser l'interface graphique (sous Unix, utilise
      le serveur X, m&#x00EA;me si $DISPLAY n'est pas d&#x00E9;fini).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-h</b> <i>HAUTEUR</i>,
    <b>--export-height</b>=<i>HAUTEUR</i></dt>
  <dd class="It-tag">Hauteur du bitmap g&#x00E9;n&#x00E9;r&#x00E9; en pixels.
      Cette valeur pr&#x00E9;empte l'option --export-dpi (ou la PPP
      enregistr&#x00E9;e avec le document si --export-use-hints est aussi
      utilis&#x00E9;).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-i</b> <i>ID</i>, <b>--export-id</b>=<i>ID</i></dt>
  <dd class="It-tag">Lors des exportations PNG, PS, EPS, PDF et SVG simple,
      valeur de l'attribut id de l'objet que vous voulez exporter depuis le
      document (aucun autre objet n'est export&#x00E9;). Par d&#x00E9;faut la
      zone export&#x00E9;e est la bo&#x00EE;te englobante de l'objet ; vous
      pouvez pr&#x00E9;empter ce comportement en utilisant --export-area (pour
      le PNG seulement) ou --export-area-page.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-j</b>, <b>--export-id-only</b></dt>
  <dd class="It-tag">Pour les formats PNG et SVG simple, n'exporte que l'objet
      dont l'id est sp&#x00E9;cifi&#x00E9;e avec avec l'option --export-id. Tout
      les autres objets seront cach&#x00E9;s et n'appara&#x00EE;tront pas dans
      le fichier export&#x00E9; m&#x00EA;me s'ils chevauchent l'objet
      effectivement export&#x00E9;. Cette option est ignor&#x00E9;e si
      --export-id n'est pas aussi utilis&#x00E9;.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-l</b>,
    <b>--export-plain-svg</b>=<i>NOMDEFICHIER</i></dt>
  <dd class="It-tag">Exporte le(s) document(s) en SVG brut, sans espace de nom
      sodipodi: ou inkscape: et sans m&#x00E9;tadonn&#x00E9;es RDF.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-x</b>, <b>--extension-directory</b></dt>
  <dd class="It-tag">Liste le contenu du r&#x00E9;pertoire d'extensions
      configur&#x00E9; en tant que tel par Inkscape, puis sort. Cette option est
      utilis&#x00E9;e afin que les extensions externes utilisent la
      configuration originale g&#x00E9;n&#x00E9;r&#x00E9;e &#x00E0;
      l'installation d'Inkscape.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--verb-list</b></dt>
  <dd class="It-tag">Liste tous les verbes disponibles dans Inkscape par
      identifiant. Cet identifiant peut &#x00EA;tre utilis&#x00E9; pour
      d&#x00E9;finir les actions du clavier ou les menus. Il peut
      &#x00E9;galement &#x00EA;tre utilis&#x00E9; avec l'option de ligne de
      commande --verb.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--verb</b>=<i>VERB-ID</i>,
    <b>--select</b>=<i>OBJECT-ID</i></dt>
  <dd class="It-tag">Ces deux options fonctionnent de concert pour offrir la
      possibilit&#x00E9; d'&#x00E9;crire des scripts simples pour Inkscape
      depuis la ligne de commande. Il peuvent appara&#x00EE;tre sur la ligne de
      commande aussi souvent que n&#x00E9;cessaire et sont
      ex&#x00E9;cut&#x00E9;s dans l'ordre pour tous les documents
      sp&#x00E9;cifi&#x00E9;s.
    <div style="height: 1.00em;">&#x00A0;</div>
    La commande --verb ex&#x00E9;cute une action sp&#x00E9;cifique comme si elle
      &#x00E9;tait appel&#x00E9;e depuis un menu ou un bouton. Un bo&#x00EE;te
      de dialogue appara&#x00EE;t lorsqu'elle fait partie de l'action. Utilisez
      l'option --verb-list pour lister les identifiants d'action disponibles.
    <div style="height: 1.00em;">&#x00A0;</div>
    La commande --select s&#x00E9;lectionne les objects correspondants &#x00E0;
      l'identifiant sp&#x00E9;cifi&#x00E9;. Les actions suivantes ne
      s'appliquent alors qu'&#x00E0; cette s&#x00E9;lection. Pour
      d&#x00E9;s&#x00E9;lectionner tous les objets, utilisez
      --verb=EditDeselect. Les identifiants d'objet disponibles d&#x00E9;pendent
      du document ouvert.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-p</b> <i>IMPRIMANTE</i>,
    <b>--print</b>=<i>IMPRIMANTE</i></dt>
  <dd class="It-tag">Imprime le(s) document(s) vers l'imprimante
      sp&#x00E9;cifi&#x00E9;e en utilisant `lpr -P IMPRIMANTE'. Vous pouvez
      aussi utiliser `| COMMANDE' pour sp&#x00E9;cifier un tube de commande
      diff&#x00E9;rent, ou utiliser `&gt; NOMDEFICHIER' pour &#x00E9;crire le
      r&#x00E9;sultat PostScript dans un fichier au lieu de l'imprimer.
      N'oubliez pas d'utiliser les guillemets appropri&#x00E9;s pour votre
      shell, par exemple&#x00A0;:
    <div style="height: 1.00em;">&#x00A0;</div>
    inkscape --print='| ps2pdf - mondoc.pdf' mondoc.svg</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-t</b>, <b>--export-use-hints</b></dt>
  <dd class="It-tag">Utilise le nom de fichier et la PPP enregistr&#x00E9;s avec
      l'objet export&#x00E9; (uniquement si --export-id est
      sp&#x00E9;cifi&#x00E9;). Ces valeurs sont automatiquement
      sp&#x00E9;cifi&#x00E9;es si vous exportez la s&#x00E9;lection depuis
      Inkscape. Donc, si par exemple, vous exportez la forme
      id=&quot;path231&quot; en tant que /home/me/shape.png avec une
      r&#x00E9;solution de 300 ppp depuis document.svg en utilisant l'interface
      graphique d'Inkscape, et sauvez le document, vous pourrez
      r&#x00E9;exporter plus tard cette forme vers le m&#x00EA;me fichier et
      avec la m&#x00EA;me r&#x00E9;solution en utilisant simplement la
      commande&#x00A0;:
    <div style="height: 1.00em;">&#x00A0;</div>
    inkscape -i path231 -t document.svg
    <div style="height: 1.00em;">&#x00A0;</div>
    Si vous utilisez --export-dpi, --export-width, ou --export-height avec cette
      option, la PPP enregistr&#x00E9;e avec le document sera ignor&#x00E9;e et
      la valeur fournie &#x00E0; la ligne de commande utilis&#x00E9;e. Si vous
      utilisez --export-png avec cette option, le nom de fichier
      enregistr&#x00E9; avec le document sera ignor&#x00E9; et le nom de fichier
      fourni &#x00E0; la ligne de commande utilis&#x00E9;.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-w</b> <i>LARGEUR</i>,
    <b>--export-width</b>=<i>LARGEUR</i></dt>
  <dd class="It-tag">Largeur du bitmap g&#x00E9;n&#x00E9;r&#x00E9; en pixels.
      Cette valeur pr&#x00E9;empte l'option --export-dpi setting (ou la PPP
      enregistr&#x00E9;e avec le document si --export-use-hints est aussi
      utilis&#x00E9;).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-y</b> <i>VALEUR</i>,
    <b>--export-background-opacity</b>= <i>VALEUR</i></dt>
  <dd class="It-tag">Opacit&#x00E9; du fond du PNG export&#x00E9;. Cela peut
      &#x00EA;tre une valeur entre 0.0 et 1.0 (0.0&#x00A0;: compl&#x00E8;tement
      transparent, 1.0 compl&#x00E8;tement opaque) ou sup&#x00E9;rieure &#x00E0;
      1 et inf&#x00E9;rieure &#x00E0; 255 (255&#x00A0;: compl&#x00E8;tement
      opaque). Si cette valeur n'est pas sp&#x00E9;cifi&#x00E9;e et si l'option
      -b n'est pas utilis&#x00E9;e, l'opacit&#x00E9; de la page
      enregistr&#x00E9;e avec le document (dans l'attribut inkscape:pageopacity=
      de sodipodi:namedview) sera utilis&#x00E9;e. Si cette valeur n'est pas
      sp&#x00E9;cifi&#x00E9;e mais que l'option -b est utilis&#x00E9;e, la
      valeur 255 (opacit&#x00E9; compl&#x00E8;te) sera utilis&#x00E9;e.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-P</b> <i>NOMDEFICHIER</i>,
    <b>--export-ps</b>=<i>NOMDEFICHIER</i></dt>
  <dd class="It-tag">Exporte le ou les documents au format PostScript. Notez que
      PostScript ne supporte pas la transparence, et que tout objet transparent
      dans le SVG original sera automatiquement rast&#x00E9;ris&#x00E9;. Les
      polices utilis&#x00E9;s sont incorpor&#x00E9;es en tant que sous-ensemble.
      La zone d'exportation par d&#x00E9;faut est la page, mais vous pouvez
      choisir de limiter cette zone au dessin avec l'option
      --export-area-drawing. Il est &#x00E9;galement possible de n'exporter
      qu'un objet en sp&#x00E9;cifiant --export-id (tous les autres objets sont
      cach&#x00E9;s). Dans ce cas, la zone d'exportation correspond &#x00E0;
      celle de l'objet choisi, &#x00E0; moins que vous n'ajoutiez l'option
      --export-area-page pour que cette zone prenne la taille de la page.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-E</b> <i>NOMDEFICHIER</i>,
    <b>--export-eps</b>=<i>NOMDEFICHIER</i></dt>
  <dd class="It-tag">Exporte le ou les documents au format Encapsulated
      PostScript. Notez que PostScript ne supporte pas la transparence, et que
      tout objet transparent dans le SVG original sera automatiquement
      rast&#x00E9;ris&#x00E9;. Les polices utilis&#x00E9;s sont
      incorpor&#x00E9;es en tant que sous-ensemble. La zone d'exportation par
      d&#x00E9;faut est la page, mais vous pouvez choisir de limiter cette zone
      au dessin avec l'option --export-area-drawing. Il est &#x00E9;galement
      possible de n'exporter qu'un objet en sp&#x00E9;cifiant --export-id (tous
      les autres objets sont cach&#x00E9;s).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-A</b> <i>FILENAME</i>,
    <b>--export-pdf</b>=<i>FILENAME</i></dt>
  <dd class="It-tag">Exporte le ou les documents au format PDF. Ce format
      pr&#x00E9;serve la transparence des objets pr&#x00E9;sents dans le SVG
      original. Les polices utilis&#x00E9;s sont incorpor&#x00E9;es en tant que
      sous-ensemble. La zone d'exportation par d&#x00E9;faut est la page, mais
      vous pouvez choisir de limiter cette zone au dessin avec l'option
      --export-area-drawing. Il est &#x00E9;galement possible de n'exporter
      qu'un objet en sp&#x00E9;cifiant --export-id (tous les autres objets sont
      cach&#x00E9;s). Dans ce cas, la zone d'exportation correspond &#x00E0;
      celle de l'objet choisi, &#x00E0; moins que vous n'ajoutiez l'option
      --export-area-page pour que cette zone prenne la taille de la page.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-pdf-version</b>=<i>VERSION-PDF</i></dt>
  <dd class="It-tag">S&#x00E9;lectionne la version PDF utilis&#x00E9;e pour
      exporter le fichier. Cette option ne fait que r&#x00E9;utiliser le
      s&#x00E9;lecteur de version PDF pr&#x00E9;sent dans la bo&#x00EE;te de
      dialogue d'exportation en PDF de l'interface graphique. Vous devez donc
      fournir une des versions propos&#x00E9;es par ce s&#x00E9;lecteur (par
      exemple &#x00AB; 1.4 &#x00BB;. La version par d&#x00E9;faut est &#x00AB;
      1.4 &#x00BB;.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-latex</b></dt>
  <dd class="It-tag">Pour l'exportation en PS, EPS ou PDF. Utilis&#x00E9; pour
      cr&#x00E9;er des images pour les documents LaTeX, pour lesquels les textes
      sont compos&#x00E9;s par LaTeX. Lors de l'exportation PS, EPS ou PDF,
      cette option s&#x00E9;pare la sortie en un fichier PS, EPS ou PDF
      (lorsque, par exemple, l'option --export-pdf est positionn&#x00E9;e) et en
      un fichier LaTeX. Le text n'est pas enregistr&#x00E9; dans le PS, EPS ou
      PDF, mais appara&#x00EE;t dans le fichier LaTex, qui lui-m&#x00EA;me
      inclut le PS, EPS ou PDF. Inclure le fichier LaTeX (\input{image.tex})
      dans un document LaTeX fait alors appara&#x00EE;tre l'image, et tout le
      texte compos&#x00E9; par LaTeX. Se r&#x00E9;f&#x00E9;rer au document LaTeX
      g&#x00E9;n&#x00E9;r&#x00E9; pour de plus amples informations (voir
      &#x00E9;galement la sortie terminal de la commande GNUPlot
    `epslatex').</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-T</b>, <b>--export-text-to-path</b></dt>
  <dd class="It-tag">Convertit les objets texte en chemins lors de l'export, si
      applicable (pour l'exportation en PS, EPS, PDF ou SVG).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--export-ignore-filters</b></dt>
  <dd class="It-tag">Exporte les objets filtr&#x00E9;s (avec du flou, par
      exemple) comme des vecteurs, en ignorant les filtres (pour l'exportation
      en PS, EPS ou PDF). Par d&#x00E9;faut, tous les objets filtr&#x00E9;s sont
      rast&#x00E9;ris&#x00E9;s &#x00E0; une d&#x00E9;finition choisie par
      --export-dpi (par d&#x00E9;faut 90 ppp), en pr&#x00E9;servant son
      apparence.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-I</b>, <b>--query-id</b></dt>
  <dd class="It-tag">Identifiant de l'objet dont les dimensions sont
      demand&#x00E9;es. Si cette option n'est pas utilis&#x00E9;e, la commande
      retournera les dimensions du dessin, pas de la page ou de la zone
      affich&#x00E9;e.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-X</b>, <b>--query-x</b></dt>
  <dd class="It-tag">Demande l'abscisse (coordonn&#x00E9;e X) du dessin ou, si
      sp&#x00E9;cifi&#x00E9; avec --query-id, de l'objet. La valeur
      retourn&#x00E9;e est en pixels (unit&#x00E9; utilisateur SVG).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-Y</b>, <b>--query-y</b></dt>
  <dd class="It-tag">Demande l'ordonn&#x00E9;e (coordonn&#x00E9;e Y) du dessin
      ou, si sp&#x00E9;cifi&#x00E9; avec --query-id de l'objet. La valeur
      retourn&#x00E9;e est en pixels (unit&#x00E9; utilisateur SVG).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-W</b>, <b>--query-width</b></dt>
  <dd class="It-tag">Demande la largeur du dessin ou, si sp&#x00E9;cifi&#x00E9;
      avec --query-id, de l'objet. La valeur retourn&#x00E9;e est en pixels
      (unit&#x00E9; utilisateur SVG).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-H</b>, <b>--query-height</b></dt>
  <dd class="It-tag">Demande la hauteur du dessin ou, si sp&#x00E9;cifi&#x00E9;
      avec --query-id, de l'objet. La valeur retourn&#x00E9;e est en pixels
      (unit&#x00E9; utilisateur SVG).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-S</b>, <b>--query-all</b></dt>
  <dd class="It-tag">Affiche un liste d&#x00E9;limit&#x00E9;e par des virgules
      des tous les objets du document SVG comprenant leur identifiant, et les
      valeurs x, y, largeur et hauteur.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--shell</b></dt>
  <dd class="It-tag">Avec ce param&#x00E8;tre, Inkscape entre en mode de ligne
      de commande interactif. Dans ce mode, vous pouvez envoyer des commandes
      &#x00E0; Inkscape par le prompt, sans avoir &#x00E0; lancer une nouvelle
      instance du logiciel &#x00E0; chaque commande. Cette fonctionnalit&#x00E9;
      est particuli&#x00E8;rement utile pour une utilisation en scripts et en
      serveur. Elle permet d'am&#x00E9;liorer la vitesse d'ex&#x00E9;cution et
      l'occupation en m&#x00E9;moire des scripts utilis&#x00E9;s de fa&#x00E7;on
      r&#x00E9;p&#x00E9;t&#x00E9;e. Chaque commande, dans ce mode, doit contenir
      tous les param&#x00E8;tres d'une ligne de commande classique, &#x00E0;
      l'exception du nom du programme (inkscape), comme dans l'exemple
      suivant&#x00A0;: &quot;fichier.svg --export-pdf=fichier.pdf&quot;.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--vacuum-defs</b></dt>
  <dd class="It-tag">Supprime tous les &#x00E9;l&#x00E9;ments inutilis&#x00E9;s
      de la section &lt;lt&gt;defs&lt;gt&gt; du fichier SVG. Si cette option est
      utilis&#x00E9;e avec --export-plain-svg, seul le fichier export&#x00E9;
      sera affect&#x00E9;. Si cette option est utilis&#x00E9;e seule, le fichier
      sp&#x00E9;cifi&#x00E9; sera modifi&#x00E9;.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>-z</b>, <b>--without-gui</b></dt>
  <dd class="It-tag">Ne lance pas l'interface graphique (sous Unix, n'utilise
      pas le server X)&#x00A0;; ne traite les fichiers que depuis la console.
      Ceci est pr&#x00E9;suppos&#x00E9; pour les options -p, -e, -l et
      --vacuum-defs.</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--g-fatal-warnings</b></dt>
  <dd class="It-tag">Cette option GTK standard force l'arr&#x00EA;t d'Inkscape
      d&#x00E8;s qu'un message d'avertssement (g&#x00E9;n&#x00E9;ralement sans
      gravit&#x00E9;) est envoy&#x00E9; (utilis&#x00E9;e &#x00E0; des fins de
      d&#x00E9;boggage).</dd>
</dl>
<dl class="Bl-tag">
  <dt class="It-tag"><b>--usage</b></dt>
  <dd class="It-tag">Affiche un bref message sur l'utilisation d'Inkscape.</dd>
</dl>
<h1 class="Sh" title="Sh" id="CONFIGURATION"><a class="selflink" href="#CONFIGURATION">CONFIGURATION</a></h1>
Le fichier de configuration principal est plac&#x00E9; dans
  ~/.config/Inkscape/preferences.xml. Il contient plusieurs types de
  param&#x00E9;trages dont vous pouvez changer la valeur dans Inkscape (la
  plupart dans la bo&#x00EE;te de dialogue Pr&#x00E9;f&#x00E9;rences
  d'Inkscape). Vous pouvez ajouter des configurations sp&#x00E9;cifiques dans
  les sous-r&#x00E9;pertoires suivants&#x00A0;:
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/Inkscape/extensions/ - extensions.
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/Inkscape/icons/ - ic&#x00F4;nes.
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/Inkscape/keys/ - association des touches du
  clavier aux commandes.
<div class="Pp"></div>
<b></b><b>$HOME</b><b></b>/.config/Inkscape/templates/ - mod&#x00E8;les de
  fichiers.
<h1 class="Sh" title="Sh" id="DIAGNOSTICS"><a class="selflink" href="#DIAGNOSTICS">DIAGNOSTICS</a></h1>
Le programme retourne la valeur z&#x00E9;ro apr&#x00E8;s une utilisation
  r&#x00E9;ussie ou diff&#x00E9;rente de z&#x00E9;ro apr&#x00E8;s un
  probl&#x00E8;me.
<div class="Pp"></div>
Des messages d'erreur et des avertissements divers peuvent &#x00EA;tre
  envoy&#x00E9;s vers STDERR ou STDOUT. Si le programme se comporte de
  fa&#x00E7;on erratique avec un fichier SVG particulier, ou se plante, il est
  utile de chercher des indices dans ces messages.
<h1 class="Sh" title="Sh" id="EXEMPLES"><a class="selflink" href="#EXEMPLES">EXEMPLES</a></h1>
Bien qu' <b>Inkscape</b> soit principalement con&#x00E7;u comme une application
  graphique, il peut aussi &#x00EA;tre utilis&#x00E9; depuis la ligne de
  commande pour certaines op&#x00E9;rations SVG.
<div class="Pp"></div>
Ouvrir un fichier SVG avec l'interface graphique&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg
</pre>
<div class="Pp"></div>
Imprimer un fichier SVG&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg -p '| lpr'
</pre>
<div class="Pp"></div>
Exporter un fichier SVG en PNG avec la r&#x00E9;solution par d&#x00E9;faut de 90
  ppp (un pixel bitmap correspondant &#x00E0; une unit&#x00E9; utilisateur
  SVG)&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --export-png=nomdefichier.png
</pre>
<div class="Pp"></div>
Idem, mais en for&#x00E7;ant les dimensions du fichier &#x00E0; 600x400
  pixels&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --export-png=nomdefichier.png -w600 -h400
</pre>
<div class="Pp"></div>
Idem, mais en exportant le dessin (la bo&#x00EE;te englobante de tous les
  objets), et pas la page&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --export-png=nomdefichier.png --export-area-drawing
</pre>
<div class="Pp"></div>
Exporter en PNG l'objet id=&quot;text1555&quot;, en utilisant le nom de fichier
  et la r&#x00E9;solution utilis&#x00E9;s la derni&#x00E8;re fois qu'il a
  &#x00E9;t&#x00E9; export&#x00E9; depuis l'interface graphique&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --export-id=text1555 --export-use-hints
</pre>
<div class="Pp"></div>
Idem, mais en utilisant une r&#x00E9;solution de 90 ppp, en sp&#x00E9;cifiant un
  nom de fichier et en arrondissant la zone &#x00E0; exporter aux valeurs
  enti&#x00E8;res juste sup&#x00E9;rieures en unit&#x00E9;s utilisateur SVG
  (afin de pr&#x00E9;server l'alignement des objets sur des pixels et minimiser
  l'anti-cr&#x00E9;nelage)&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --export-id=text1555 --export-png=text.png --export-area-snap
</pre>
<div class="Pp"></div>
Convertir un document du format SVG Inkscape au format SVG brut&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier1.svg --export-plain-svg=nomdefichier2.svg
</pre>
<div class="Pp"></div>
Convertir un document SVG en EPS, en convertissant les textes en
  chemins&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --export-eps=nomdefichier.eps --export-text-to-path
</pre>
<div class="Pp"></div>
Demander la largeur de l'objet avec un id=&quot;text1555&quot;&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --query-width --query-id text1555
</pre>
<div class="Pp"></div>
Dupliquer l'objet ayant pour identifiant id=&quot;path1555&quot;, puis appliquer
  une rotation de 90 degr&#x00E9;s sur le duplicat, enregistrer le SVG et
  quitter&#x00A0;:
<div class="Pp"></div>
<pre>
    inkscape nomdefichier.svg --select=path1555 --verb=EditDuplicate --verb=ObjectRotate90 --verb=FileSave --verb=FileClose
</pre>
<h1 class="Sh" title="Sh" id="ENVIRONEMENT"><a class="selflink" href="#ENVIRONEMENT">ENVIRONEMENT</a></h1>
<b>DISPLAY</b> pour obtenir l'h&#x00F4;te par d&#x00E9;faut et le num&#x00E9;ro
  d'affichage.
<div class="Pp"></div>
<b>TMPDIR</b> pour d&#x00E9;finir le chemin par d&#x00E9;faut du
  r&#x00E9;pertoire &#x00E0; utiliser pour stocker les fichier temporaires. Le
  r&#x00E9;pertoire doit exister.
<div class="Pp"></div>
<b>INKSCAPE_PROFILE_DIR</b> pour d&#x00E9;finir le chemin du r&#x00E9;pertoire
  &#x00E0; utiliser pour le profil utilisateur.
<h1 class="Sh" title="Sh" id="TH&#x00C8;MES"><a class="selflink" href="#TH&#x00C8;MES">TH&#x00C8;MES</a></h1>
Vous pouvez remplacer le fichier d'ic&#x00F4;nes par d&#x00E9;faut
  <b></b><b>$PREFIX</b> <b></b>/share/inkscape/icons/icons.svg en utilisant le
  r&#x00E9;pertoire <b></b><b>$HOME</b><b></b>/.config/inkscape/icons/. Les
  ic&#x00F4;nes sont charg&#x00E9;es par nom (ex.&#x00A0;: <i>fill_none.svg</i>)
  ou, si elles sont introuvables, depuis le fichier <i>icons.svg</i>. Si une
  ic&#x00F4;ne n'est pas trouv&#x00E9;e dans l'un de ces emplacements, elle est
  charg&#x00E9;e depuis l'emplacement par d&#x00E9;faut du syst&#x00E8;me.
<div class="Pp"></div>
Les ic&#x00F4;nes n&#x00E9;cessaires sont charg&#x00E9;es depuis les fichiers
  SVG par recherche de l'id SVG correspondant (Par exemple, pour charger
  l'ic&#x00F4;ne &quot;fill_none&quot; depuis un fichier, le contenu
  identifi&#x00E9; par l'id SVG &quot;fill_none&quot; est rendu en tant que
  cette ic&#x00F4;ne, qu'il vienne du fichier <i>fill_none.svg</i> ou du fichier
  <i>icons.svg</i>).
<h1 class="Sh" title="Sh" id="AUTRES_INFORMATIONS"><a class="selflink" href="#AUTRES_INFORMATIONS">AUTRES
  INFORMATIONS</a></h1>
L'endroit principal pour trouver des informations sur <b>Inkscape</b> est
  http://www.inkscape.org/. Le site web contient des liens vers d'autres
  &#x00E9;l&#x00E9;ments pertinents&#x00A0;: documentation, didacticiels, manuel
  de l'utilisateur, exemples, archives des listes de diffusion, la
  derni&#x00E8;re version d'Inkscape, les bases contenant les d&#x00E9;fauts et
  les demandes d'&#x00E9;volution, et bien d'autres choses.
<h1 class="Sh" title="Sh" id="VOIR_AUSSI"><a class="selflink" href="#VOIR_AUSSI">VOIR
  AUSSI</a></h1>
potrace, cairo, <i>rsvg</i>(1), batik, ghostscript, pstoedit.
<div class="Pp"></div>
Suite de tests de conformit&#x00E9; SVG&#x00A0;:
  http://www.w3.org/Graphics/SVG/Test/
<div class="Pp"></div>
Validation de SVG&#x00A0;: http://jiggles.w3.org/svgvalidator/
<div class="Pp"></div>
<i>Scalable Vector Graphics (SVG) 1.1 Specification</i> <i>W3C Recommendation
  14</i> <i>January 2003</i> &lt;http://www.w3.org/TR/SVG11/&gt;
<div class="Pp"></div>
<i>Scalable Vector Graphics (SVG) 1.2 Specification</i> <i>W3C Working Draft
  13</i> <i>November 2003</i> &lt;http://www.w3.org/TR/SVG12/&gt;
<div class="Pp"></div>
<i>SVG 1.1/1.2/2.0 Requirements</i> <i>W3C Working Draft 22 April 2002</i>
  &lt;http://www.w3.org/TR/SVG2Reqs/&gt;
<div class="Pp"></div>
<i>Document Object Model (DOM): Level 2 Core</i> <i>Arnaud Le Hors et al
  editors,</i> <i>W3C</i> &lt;http://www.w3.org/TR/DOM-Level-2-Core/&gt;
<h1 class="Sh" title="Sh" id="NOTES_SUR_L'INTERFACE_GRAPHIQUE"><a class="selflink" href="#NOTES_SUR_L'INTERFACE_GRAPHIQUE">NOTES
  SUR L'INTERFACE GRAPHIQUE</a></h1>
Pour vous familiariser avec l'utilisation de l'interface graphique d'Inkscape,
  consultez les didacticiels dans Aide &gt; Didacticiels.
<div class="Pp"></div>
Inkscape permet d'importer (Fichier &gt; Importer) la plupart des formats
  bitmaps PNG, BMP, JPG, XPM, GIF, etc.), du texte brut (n&#x00E9;cessite Perl),
  PS et EPS (n&#x00E9;cessite Ghostscript) et les formats PDF et AI (documents
  Adobe Illustrato 9.0 ou plus r&#x00E9;cent).
<div class="Pp"></div>
Inkscape permet d'exporter (Fichier &gt; Exporter une image PNG) des images PNG
  32-bits, mais aussi aux formats AI, PS, EPS, PDF, DXF et plusieurs autres
  formats (via Fichier &gt; Enregistrer sous).
<div class="Pp"></div>
Inkscape supporte la pression et l'inclinaison du stylet d'une tablette
  graphique pour la largeur, la force et l'angle de plusieurs outils dont la
  plume calligraphique.
<div class="Pp"></div>
Inkscape comporte une interface graphique pour le moteur de vectorisation de
  bitmaps Potrace (http://potrace.sf.net) qui est inclus dans Inkscape.
<div class="Pp"></div>
Inkscape peut utiliser des scripts externes (filtres de stdin vers stdout)
  repr&#x00E9;sent&#x00E9;s par des commandes dans le menu Effets. Un script
  peut avoir une interface graphique, sous forme de bo&#x00EE;te de dialogue,
  permettant de d&#x00E9;finir diff&#x00E9;rents param&#x00E8;tres et peut
  obtenir les IDs des objets s&#x00E9;lectionn&#x00E9;s sur lesquels agir depuis
  la ligne de commande. Inkscape est livr&#x00E9; avec un assortiment d'effets
  &#x00E9;crits en Python d&#x00E9;di&#x00E9;s principalement &#x00E0; la
  manipulation de chemin.
<h1 class="Sh" title="Sh" id="RACCOURCIS_CLAVIER"><a class="selflink" href="#RACCOURCIS_CLAVIER">RACCOURCIS
  CLAVIER</a></h1>
Pour obtenir une liste compl&#x00E8;te des raccourcis clavier et souris,
  consultez le fichier doc/keys.html, ou utilisez la commande Clavier et souris
  dans le menu d'aide de l'interface graphique.
<h1 class="Sh" title="Sh" id="D&#x00C9;FAUTS"><a class="selflink" href="#D&#x00C9;FAUTS">D&#x00C9;FAUTS</a></h1>
Beaucoup de bugs sont connus&#x00A0;; veuillez s'il vous pla&#x00EE;t consulter
  le site web pour v&#x00E9;rifier ceux qui ont d&#x00E9;j&#x00E0;
  &#x00E9;t&#x00E9; rapport&#x00E9;s et pour soumettre de nouveaux
  probl&#x00E8;mes. Consultez aussi la section &quot;Known Issues&quot; des
  notes de votre version (dans le fichier `NEWS').
<h1 class="Sh" title="Sh" id="AUTEURS"><a class="selflink" href="#AUTEURS">AUTEURS</a></h1>
Ce code doit son existence &#x00E0; un grand nombre de contributeurs tout au
  long de ses diff&#x00E9;rentes incarnations. La liste qui suit est
  certainement incompl&#x00E8;te mais permet de reconna&#x00EE;tre les
  nombreuses &#x00E9;paules sur lesquelles cette application s'est
  appuy&#x00E9;e&#x00A0;:
<div class="Pp"></div>
Maximilian Albert, Joshua A. Andler, Tavmjong Bah, Pierre Barbry-Blot,
  Jean-Fran&#x00E7;ois Barraud, Campbell Barton, Bill Baxter, John Beard, John
  Bintz, Arpad Biro, Nicholas Bishop, Joshua L. Blocher, Hanno B&#x00F6;ck,
  Tomasz Boczkowski, Henrik Bohre, Boldewyn, Daniel Borgmann, Bastien Bouclet,
  Hans Breuer, Gustav Broberg, Christopher Brown, Marcus Brubaker, Luca Bruno,
  Nicu Buculei, Bulia Byak, Pierre Caclin, Ian Caldwell, Gail Carmichael, Ed
  Catmur, Chema Celorio, Jabiertxo Arraiza Cenoz, Johan Ceuppens, Zbigniew
  Chyla, Alexander Clausen, John Cliff, Kees Cook, Ben Cromwell, Robert Crosbie,
  Jon Cruz, Aur&#x00E9;lie De-Cooman, Kris De Gussem, Milosz Derezynski, Daniel
  D&#x00ED;az, Bruno Dilly, Larry Doolittle, Nicolas Dufour, Tim Dwyer, Maxim V.
  Dziumanenko, Johan Engelen, Miklos Erdelyi, Ulf Erikson, No&#x00E9; Falzon,
  Frank Felfe, Andrew Fitzsimon, Edward Flick, Marcin Floryan, Fred, Ben Fowler,
  Cedric Gemy, Steren Giannini, Olivier Gondouin, Ted Gould, Toine de Greef,
  Michael Grosberg, Bryce Harrington, Dale Harvey, Aur&#x00E9;lio Adnauer
  Heckert, Carl Hetherington, Jos Hirth, Hannes Hochreiner, Thomas Holder, Joel
  Holdsworth, Christoffer Holmstedt, Alan Horkan, Karl Ove Hufthammer, Richard
  Hughes, Nathan Hurst, inductiveload, Thomas Ingham, Jean-Olivier Irisson, Bob
  Jamison, Ted Janeczko, jEsuSdA, Lauris Kaplinski, Lynn Kerby, Niko Kiirala,
  James Kilfiger, Nikita Kitaev, Jason Kivlighn, Adrian Knoth, Krzysztof
  Kosi&#x0144;ski, Petr Kovar, Beno&#x00EE;t Lavorata, Alex Leone, Julien Leray,
  Raph Levien, Diederik van Lierop, Nicklas Lindgren, Vitaly Lipatov, Ivan
  Louette, Fernando Lucchesi Bastos Jurema, Pierre-Antoine Marc,
  Aurel-Aim&#x00E9; Marmion, Colin Marquardt, Craig Marshall, Ivan Mas&#x00E1;r,
  Dmitry G. Mastrukov, David Mathog, Matiphas, Michael Meeks, Federico Mena,
  MenTaLguY, Aubanel Monnier, Vincent Montagne, Tim Mooney, Derek P. Moore,
  Chris Morgan, Peter Moulder, J&#x00F6;rg M&#x00FC;ller, Yukihiro Nakai, Victor
  Navez, Christian Neumair, Nick, Andreas Nilsson, Mitsuru Oka, Vin&#x00ED;cius
  dos Santos Oliveira, Martin Owens, Alvin Penner, Matthew Petroff, Jon
  Phillips, Zdenko Podobny, Alexandre Prokoudine, Jean-Ren&#x00E9; Reinhard,
  Alexey Remizov, Frederic Rodrigo, Hugo Rodrigues, Juarez Rudsatz, Xavier Conde
  Rueda, Felipe Corr&#x00EA;a da Silva Sanches, Christian Schaller, Marco
  Scholten, Tom von Schwerdtner, Danilo &#x0160;egan, Abhishek Sharma, Shivaken,
  Michael Sloan, John Smith, Bo&#x0161;tjan &#x0160;peti&#x010D;, Aaron Spike,
  Kaushik Sridharan, Ralf Stephan, Dariusz Stojek, Martin Sucha, ~suv, Pat
  Suwalski, Adib Taraben, Hugh Tebby, Jonas Termeau, David Turner, Andre
  Twupack, Aleksandar Uro&#x0161;evi&#x0107;, Alex Valavanis, Joakim Verona,
  Lucas Vieites, Daniel Wagenaar, Liam P. White, Sebastian W&#x00FC;st, Michael
  Wybrow, Gellule Xg, Daniel Yacob, David Yip, Masatake Yamato
<div class="Pp"></div>
Cette page de manuel a &#x00E9;t&#x00E9; cr&#x00E9;&#x00E9;e par Bryce
  Harrington &lt;brycehar@bryceharrington.org&gt;.
<h1 class="Sh" title="Sh" id="HISTORIQUE"><a class="selflink" href="#HISTORIQUE">HISTORIQUE</a></h1>
Le code qui allait devenir Inkscape est n&#x00E9; en 1999, avec le programme
  Gill, GNOME Illustrator, cr&#x00E9;&#x00E9; par Raph Levien. L'objectif
  d&#x00E9;fini pour Gill &#x00E9;tait de supporter compl&#x00E8;tement le
  format SVG. Raph a cod&#x00E9; le mod&#x00E8;le Postcript de courbes de
  B&#x00E9;zier, incluant le remplissage et le contour, les coiffes et raccords
  de lignes, le texte, etc. La page de Raph consacr&#x00E9;e &#x00E0; Gill se
  trouve sur http://www.levien.com/svg/. Le travail sur Gill semble avoir
  diminu&#x00E9; ou s'&#x00EA;tre arr&#x00EA;t&#x00E9; en 2000.
<div class="Pp"></div>
L'incarnation suivante du code allait devenir le tr&#x00E8;s populaire Sodipodi,
  men&#x00E9; par Lauris Kaplinski. Le code est devenu un outil d'illustration
  puissant apr&#x00E8;s plusieurs ann&#x00E9;es de travail, ajoutant plusieurs
  nouvelles fonctionnalit&#x00E9;s, le support multilingue, le portage sous
  Windows et d'autres syst&#x00E8;mes d'exploitation et &#x00E9;liminant
  certaines d&#x00E9;pendances.
<div class="Pp"></div>
Inkscape a &#x00E9;t&#x00E9; lanc&#x00E9; en 2003 par quatre d&#x00E9;veloppeurs
  actifs de Sodipodi (Bryce Harrington, MenTaLguY, Nathan Hurst et Ted Gould),
  qui voulaient faire prendre une orientation diff&#x00E9;rente au code en
  termes de focalisation sur la conformit&#x00E9; SVG, aspect et fonctionnement
  de l'interface, et d'opportunit&#x00E9;s de d&#x00E9;veloppement ouvertes
  &#x00E0; plus de participants. Le projet a progress&#x00E9; rapidement,
  gagnant de nombreux contributeurs et une multitude de fonctionnalit&#x00E9;s.
<div class="Pp"></div>
Beaucoup de travail a &#x00E9;t&#x00E9; depuis consacr&#x00E9; &#x00E0; la
  stabilisation du code et &#x00E0; l'internationalisation. Le moteur de rendu
  h&#x00E9;rit&#x00E9; de Sodipodi comportait de nombreuses
  sp&#x00E9;cificit&#x00E9;s qui entrainaient de plantages lorsque l'utilisation
  du programme sortait des sentiers battus. Ce moteur a alors &#x00E9;t&#x00E9;
  remplac&#x00E9; par Livarot qui, bien qu'imparfait, g&#x00E9;n&#x00E9;rait
  moins d'erreurs. Le projet a &#x00E9;galement adopt&#x00E9; la bonne habitude
  de publier son code r&#x00E9;guli&#x00E8;rement, et encourag&#x00E9; les
  utilisateurs &#x00E0; tester des versions en d&#x00E9;veloppement du logiciel,
  ce qui a bien aid&#x00E9; dans l'identification des nouveaux d&#x00E9;fauts,
  et donn&#x00E9; les moyens aux utilisateurs de v&#x00E9;rifier que les anciens
  &#x00E9;taient bien corrig&#x00E9;s. Inkscape a ainsi acquis une
  r&#x00E9;putation de programme robuste et fiable.
<div class="Pp"></div>
En parall&#x00E8;le, des efforts ont &#x00E9;t&#x00E9; faits pour
  am&#x00E9;liorer l'internationalisation et la localisation de l'interface, ce
  qui a apport&#x00E9; au projet de nouveaux contributeurs tout autour du monde.
<div class="Pp"></div>
Inkscape a eu un impact positif sur l'attractivit&#x00E9; visuelle de l'Open
  Source en g&#x00E9;n&#x00E9;ral, en offrant un outil pour cr&#x00E9;er et
  partager des ic&#x00F4;nes, &#x00E9;crans d'accueil, art pour le web, etc.
  D'une certaine fa&#x00E7;on, bien que n'&#x00E9;tant qu'un &quot;simple outil
  de dessin&quot;, Inkscape a jou&#x00E9; un r&#x00F4;le important en rendant
  l'Open Source plus stimulant visuellement parlant pour un plus large public.
<h1 class="Sh" title="Sh" id="COPYRIGHT_ET_LICENSE"><a class="selflink" href="#COPYRIGHT_ET_LICENSE">COPYRIGHT
  ET LICENSE</a></h1>
<b>Copyright (C)</b> 1999&#x2013;2011 des auteurs.
<div class="Pp"></div>
<b>Inkscape</b> est un logiciel libre; vous pouvez le redistribuer et/ou le
  modifier selon les termes de la license GPL. </div>
<table class="foot">
  <tr>
    <td class="foot-date"></td>
    <td class="foot-os">Inkscape-0.91pre4</td>
  </tr>
</table>
</body>
</html>
